[
{"api_name": "Registro de Referência de Unidades Federativas", "uuid": "registro-referencia-ufs", "orgao": "Instituto Brasileiro de Geografia e Estatística (IBGE)", "versao": "Versão 1.0 - 27/08/2021", "descricao": "O Registro de Referência de Unidades Federativas foi instituído pela \n (Comitê Central de Governança de Dados), e define um conjunto de dados para identificação de uma unidade da Federação que contempla o Distrito Federal e os Estados da República Federativa do Brasil. Para a instituição deste cadastro em específico foi celebrado um acordo com a Fundação Instituto Brasileiro de Geografia e Estatística (IBGE), que é o atual órgão gestor desses dados.\nA API do Registro de Referência de Unidades Federativas proporciona a interoperabilidade e a integração, visando facilitar o acesso ao conjunto de dados de Unidades Federativas a ser utilizado pelos Órgãos e Entidades da Administração Pública Federal Direta, Autárquica e Fundacional e demais interessados, sendo mais um instrumento para impulsionar a transformação digital no Estado brasileiro.\n ", "docs": null, "links": ["https://servicodados.ibge.gov.br/api/docs/localidades#api-UFs", "https://servicodados.ibge.gov.br/api/docs/localidades"], "tecnologias": ["JSON"], "tags": ["Mesorregioes", "RegioesIntermediarias", "Localidades", "IBGE", "Cidades", "Regioes", "Estados", "Municipios", "Microrregioes", "RegioesImediatas", "ServicoDeDados", "UFs"], "seguranca": ["SSL"], "hospedagem": ["IBGE"], "controle-de-acesso": ["Livre"]},
{"api_name": "SICAR Imóvel", "uuid": "sicar-imovel", "orgao": "Ministério da Gestão e da Inovação em Serviços Públicos - Secretaria de Governo Digital (MGI/SGD)", "versao": "Versão 1.0 - 13/11/2024", "descricao": "O \n é o registro público eletrônico obrigatório para todos os imóveis rurais do Brasil, com a finalidade de integrar as informações ambientais das propriedades e posses rurais, compondo base de dados para controle, monitoramento, planejamento ambiental e econômico e combate ao desmatamento.\nFoi criado pelo Código Florestal - Lei 12.651.2012 (art. 29), no âmbito do \n.\nO \n é o sistema composto por um conjunto de módulos que mantém o CAR, viabiliza o processo de análise dos cadastros de imóveis, além de disponibilizar integrações com outros sistemas externos para troca de informações.\nEsta API apresenta as informações do imóvel rural e se este manifestou intenção de adesão ao \n.\nÓrgãos e as entidades da administração pública federal direta, autárquica e fundacional e os demais Poderes da União.\nOnline", "docs": null, "links": ["https://papisp.dataprev.gov.br/sicar/imovel/1.0", "https://docs.dataprev.gov.br/docs/api/api-sicar-imovel/", "https://gerenciador-conecta.readthedocs.io/manual_recebedor_dados.html#roteiro-geracao-chaves-acesso"], "tecnologias": ["JSON"], "tags": ["SICAR", "MGI"], "seguranca": ["SSL"], "hospedagem": ["Dataprev"], "controle-de-acesso": ["OAuth"]},
{"api_name": "Registro de Referência de Países", "uuid": "registro-referencia-paises", "orgao": "Instituto Brasileiro de Geografia e Estatística (IBGE)", "versao": "Versão 1.0 - 27/08/2021", "descricao": "O Registro de Referência de Países foi instituído pela \n (Comitê Central de Governança de Dados), e define um conjunto de dados para identificação dos países reconhecidos pela Organização das Nações Unidas - ONU. Para a instituição deste cadastro em específico foi celebrado um acordo com a Fundação Instituto Brasileiro de Geografia e Estatística (IBGE), que é o atual órgão gestor desses dados.\nA API do Registro de Referência de Países proporciona a interoperabilidade e a integração, visando facilitar o acesso ao conjunto de dados de países a ser utilizado pelos Órgãos e Entidades da Administração Pública Federal Direta, Autárquica e Fundacional e demais interessados, sendo mais um instrumento para impulsionar a transformação digital no Estado brasileiro.", "docs": null, "links": ["https://servicodados.ibge.gov.br/api/docs/paises"], "tecnologias": [], "tags": ["Paises", "IBGE", "ServicoDeDados"], "seguranca": ["SSL"], "hospedagem": ["IBGE"], "controle-de-acesso": ["Livre"]},
{"api_name": "SICAR Tema", "uuid": "sicar-tema", "orgao": "Ministério da Gestão e da Inovação em Serviços Públicos - Secretaria de Governo Digital (MGI/SGD)", "versao": "Versão 1.0 - 13/11/2024", "descricao": "O \n é o registro público eletrônico obrigatório para todos os imóveis rurais do Brasil, com a finalidade de integrar as informações ambientais das propriedades e posses rurais, compondo base de dados para controle, monitoramento, planejamento ambiental e econômico e combate ao desmatamento.\nFoi criado pelo Código Florestal - Lei 12.651.2012 (art. 29), no âmbito do\n.\nO \n é o sistema composto por um conjunto de módulos que mantém o \n, viabiliza o processo de análise dos cadastros de imóveis, além de disponibilizar integrações com outros sistemas externos para troca de informações.Esta API apresenta as informações sobre os temas do imóvel rural.\nÓrgãos e as entidades da administração pública federal direta, autárquica e fundacional e os demais Poderes da União.\nOnline", "docs": null, "links": ["https://papisp.dataprev.gov.br/sicar/imovelTema/1.0", "https://docs.dataprev.gov.br/docs/api-sicar-imovel", "https://gerenciador-conecta.readthedocs.io/manual_recebedor_dados.html#roteiro-geracao-chaves-acesso"], "tecnologias": ["JSON"], "tags": ["SICAR", "MGI"], "seguranca": ["SSL"], "hospedagem": ["Dataprev"], "controle-de-acesso": ["OAuth"]},
{"api_name": "API de Serviços", "uuid": "api-de-servicos", "orgao": "Ministério da Gestão e da Inovação em Serviços Públicos - Secretaria de Governo Digital (MGI/SGD)", "versao": "Versão 1.0.0 - 13/07/2018", "descricao": "O Registro de Referência do Portal de Serviços Públicos foi instituído pela \n (Comitê Central de Governança de Dados), e tem a finalidade de:\nO Decreto nº 9.756/2019 instituiu o Portal gov.br como ferramenta centralizada para disponibilização de informações institucionais, notícias e serviços públicos prestados pelo Governo federal. Todas as informações e serviços de órgãos do Poder Executivo Federal devem estar disponíveis neste portal.\n A API de Serviços fornece os dados do Portal gov.br, com informações sobre os serviços publicados, os órgãos, as etapas dos serviços, os contatos dos órgãos etc.", "docs": null, "links": ["https://servicos.gov.br/api/v1/servicos/", "https://www.servicos.gov.br/api/v1/docs"], "tecnologias": ["REST / JSON"], "tags": ["Portal gov.br", "API de Serviços", "Ministério da Gestão e da Inovação em Serviços Públicos (MGI)"], "seguranca": ["SSL"], "hospedagem": ["SERPRO"], "controle-de-acesso": ["Livre"]},
{"api_name": "Registro de Referência de Municípios", "uuid": "registro-referencia-municipios", "orgao": "Instituto Brasileiro de Geografia e Estatística (IBGE)", "versao": "Versão 1.0 - 27/08/2021", "descricao": "O Registro de Referência de Municípios foi instituído pela \n (Comitê Central de Governança de Dados), e define um conjunto de dados para identificação de um município brasileiro. Para a instituição deste cadastro em específico foi celebrado um acordo com a Fundação Instituto Brasileiro de Geografia e Estatística (IBGE), que é o atual órgão gestor desses dados.\nA API do Registro de Referência de Municípios proporciona a interoperabilidade e a integração, visando facilitar o acesso ao conjunto de dados de Municípios a ser utilizado pelos Órgãos e Entidades da Administração Pública Federal Direta, Autárquica e Fundacional e demais interessados, sendo mais um instrumento para impulsionar a transformação digital no Estado brasileiro.", "docs": null, "links": ["https://servicodados.ibge.gov.br/api/docs/localidades"], "tecnologias": ["JSON"], "tags": ["Mesorregioes", "RegioesIntermediarias", "Localidades", "IBGE", "Cidades", "Regioes", "Estados", "Municipios", "Microrregioes", "RegioesImediatas", "ServicoDeDados", "UFs"], "seguranca": ["SSL"], "hospedagem": ["IBGE"], "controle-de-acesso": ["Livre"]},
{"api_name": "Situação Militar", "uuid": "situacao-militar", "orgao": "Comando do Exército Brasileiro (MD)", "versao": "Versão API 1.4.5 - SERMIL Web Service para integração com Sistemas Governamentais - 04/10/2021", "descricao": "O Registro de Referência de Situação Militar foi instituído pela \n, e tem a finalidade de:\ntem por finalidade consultar e informar\na situação relacionada às obrigações militares dos cidadãos do sexo masculino vinculados ao Serviço Militar Obrigatório, bem como daqueles, de ambos os sexos, que tenham prestado o serviço militar voluntário.\nRecebendo como parâmetro de entrada o CPF do cidadão, a API retorna um valor que indica se a situação militar do cidadão está regular ou não, podendo dispensar a apresentação de um dos documentos pelo cidadão: CAM – Certificado de Alistamento Militar, CR – Certificado de Reservista, CI – Certificado de Isenção ou CDI – Certificado de Dispensa de incorporação.\nCom base na Lei 4.375, de 17 de agosto de 1964, a comprovação é necessária para que o cidadão exerça alguns direitos básicos como por exemplo, emissão de passaporte, emissão de carteiras profissionais, matrícula em instituições de ensino e posse em cargos públicos.\n \nO Impacto estimado da Interoperabilidade deste serviço público é de \n.\nPara maiores informações sobre a metodologia de Cálculo de Impacto da Interoperabilidade, acesse: \n ", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/api-situacao-militar/v3/cidadao"], "tecnologias": ["application/json text/xml"], "tags": ["SituacaoMilitar", "ServicoMilitar"], "seguranca": ["SSL"], "hospedagem": ["Infraestrutura do Exército Brasileiro."], "controle-de-acesso": ["OAuth"]},
{"api_name": "Pessoa com Deficiência", "uuid": "pessoa-com-deficiencia", "orgao": "Ministério dos Direitos Humanos e da Cidadania (MDHC)", "versao": "Versão 1.0.0 - 08/03/2022", "descricao": "O Registro de Referência da Pessoa com Deficiência foi instituído pela \n (Comitê Central de Governança de Dados), e tem a finalidade de:\na) na Base de Dados do Benefício de Prestação Continuada (BPC);\nb) na Base de Dados da Aposentadoria da Pessoa com Deficiência; e\nc) na Base de Dados da Avaliação Biopsicossocial.\nRecebendo como parâmetro de entrada o CPF do cidadão, a API realiza uma pesquisa nas bases de dados relacionadas retornando um valor que indica se foi ou não encontrado um registro deste CPF cadastrado como Pessoa com Deficiência. Em caso positivo, tem-se que o cidadão pesquisado possui uma deficiência comprovada nos termos da referida Lei. Em caso de retorno negativo, a informação significa apenas que o cidadão ainda não está cadastrado em nenhuma das bases de dados pesquisadas.\nA abrangência da consulta da API será implementada em etapas, iniciando com a consulta à base de beneficiários do BPC e da \n, que r\n Posteriormente, a abrangência incluirá a pesquisa na base de dados do Cadastro-Inclusão e da Avaliação Biopsicossocial.\n \nO impacto estimado da interoperabilidade deste serviço público é de \n.\nPara maiores informações sobre a metodologia de Cálculo de Impacto da Interoperabilidade, acesse:  \n  \n \n ", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/api-pessoacomdeficiencia/v1", "https://www.gov.br/conecta/catalogo/apis/pessoa-com-deficiencia/PCD_final_conecta.json/swagger_view", "https://gerenciador-conecta.readthedocs.io/manual_recebedor_dados.html#roteiro-geracao-chaves-acesso"], "tecnologias": ["JSON"], "tags": ["LC142", "PCD", "LOAS", "BPC", "INSS", "Cadastro-Inclusão", "DEFICIENCIA", "MDHC"], "seguranca": ["SSL"], "hospedagem": ["Dataprev"], "controle-de-acesso": ["OAuth"]},
{"api_name": "Faixa de Renda de Grupo Familiar ", "uuid": "faixa-de-renda-de-grupo-familiar", "orgao": "Instituto Nacional do Seguro Social (INSS)", "versao": "Versão 1.0 - 09/12/2021", "descricao": "Utilizando como base as informações contidas no Cadastro Nacional de Informações Sociais - CNIS, a API Faixa de Renda de Grupo Familiar tem como finalidade classificar a renda média de um grupo familiar especificado por uma lista de, no mínimo, dois CPFs.\nA API calcula a renda média mensal familiar, em salários-mínimos, a partir de uma lista contendo o CPF do requerente principal e das pessoas que compõem o grupo familiar dele. A apuração da renda média mensal familiar também considera o período retroativo de doze meses a partir do mês imediatamente anterior ao mês informado no parâmetro competência. Ela classifica então o resultado obtido em \n, retornando o grupo de enquadramento do CPF do requerente principal. A API valida também se o valor declarado de renda, informado como parâmetro de entrada, é menor, igual, ou maior que o \n.\nA renda será apurada com base nas seguintes informações:\nAs informações de remunerações de vínculos empregatícios serão provenientes também do Extrato de Contribuição CNIS, fonte utilizada para reconhecimento de direito pelo INSS, com base nas fontes de dados GFIP (Guia de recolhimento do FGTS e de Informações à Previdência Social), e-Social e complementações do CNIS comprovadas pelo cidadão na rede de Atendimento do INSS.\nEmbora possam compor renda do cidadão, as informações abaixo não fazem parte do cálculo de renda média mensal familiar:\nA API otimiza consideravelmente o tempo que seria gasto pelo cidadão em informar a renda média de cada integrante de seu grupo familiar, bem como o órgão tem a certeza da veracidade da informação coletada.\nO impacto estimado da interoperabilidade deste serviço público é de \n.\nPara maiores informações sobre a metodologia de Cálculo de Impacto da Interoperabilidade, acesse: https://www.gov.br/governodigital/pt-br/governanca-de-dados/calculadora-de-impacto\n  ", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/api-renda-familiar/v1/enquadramentos-renda", "https://www.gov.br/conecta/catalogo/apis/faixa-de-renda-de-grupo-familiar/API%20Faixa%20de%20Renda.json/swagger_view", "https://gerenciador-conecta.readthedocs.io/manual_recebedor_dados.html#roteiro-geracao-chaves-acesso"], "tecnologias": ["REST/JSON"], "tags": ["FAIXADERENDA", "CIDADAO", "INSS", "DATAPREV"], "seguranca": ["SSL"], "hospedagem": ["DATAPREV"], "controle-de-acesso": ["OAuth"]},
{"api_name": "Carteira de documentos gov.br - Wallet", "uuid": "carteira-de-documentos-gov-br-wallet", "orgao": "Ministério da Economia – Secretaria de Governo Digital (ME/SGD)", "versao": "Versão 2.0 - 09/06/2022", "descricao": " ", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/api-gestao-wallet/v2/gestao/", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-envio-lotes-wallet/v2/receptor/lote"], "tecnologias": ["JSON"], "tags": ["Ministério da Economia (ME)", "gov.br", "SGD", "walletGov.br"], "seguranca": ["SSL"], "hospedagem": ["Serpro"], "controle-de-acesso": ["OAuth"]},
{"api_name": "Cadúnico Serviços  - Indicadores Familiares", "uuid": "cadunico-servicos-indicadores-familiares", "orgao": "Ministério do Desenvolvimento e Assistência Social, Família e Combate à Fome", "versao": "Versão 1.0.0 - 14/03/2024", "descricao": "O Cadastro Único para Programas Sociais do Governo Federal (Cadastro Único) é um instrumento que identifica e caracteriza as famílias de baixa renda, permitindo que o governo conheça melhor a realidade socioeconômica dessa população. Nele são registradas informações como: características do domicílio, identificação de cada pessoa, escolaridade, situação de trabalho e renda, entre outras.\nEssas informações são utilizadas pelo Governo Federal, pelos Estados e pelos municípios para implementação de políticas públicas capazes de promover a melhoria da vida dessas famílias.\nUtilizando como base as informações contidas no Cadastro Único, a API CadÚnico Serviços e Indicadores Familiares tem como finalidade retornar para uma determinada pessoa, a partir do CPF ou NIS:\nDecreto nº 11.016, de 29 de março de 2022, que regulamenta o Cadastro Único para Programas Sociais do Governo Federal, instituído pelo art. 6º-F da Lei nº 8.742, de 7 de dezembro de 1993.\nPortaria MC nº 810, de 14 de setembro de 2022, que define procedimentos para a gestão, operacionalização, cessão e utilização dos dados do Cadastro Único\nPortaria nº 501, de 29 de novembro de 2017, que disciplina o processo de uso do CadÚnico por órgãos e entidades federais como instrumento de seleção de beneficiários de políticas e programas sociais.\nPortaria nº 502, de 29 de novembro de 2017, que institui a Política de Controle de Acesso aos dados do Cadastro Único para Programas Sociais.", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/sncci/v1/dp/indicadoresFamiliar/{cpf}", "https://apigateway.conectagov.estaleiro.serpro.gov.br/sncci/v1/dp/indicadoresFamiliar/nis/{nis}", "https://www.gov.br/conecta/catalogo/apis/cadunico-servicos-indicadores-familiares/CADUNICO_Servicos_Indicadores.json/swagger_view", "https://gerenciador-conecta.readthedocs.io/manual_recebedor_dados.html#roteiro-geracao-chaves-acesso"], "tecnologias": ["JSON"], "tags": ["CADUNICO"], "seguranca": ["SSL"], "hospedagem": ["DATAPREV"], "controle-de-acesso": ["OAuth"]},
{"api_name": "CadÚnico Serviços - Dados Familiares", "uuid": "cadunico-servicos-dados-familiares", "orgao": "Ministério do Desenvolvimento e Assistência Social, Família e Combate à Fome", "versao": "Versão 1.0.0 - 14/03/2024", "descricao": "O Cadastro Único para Programas Sociais do Governo Federal (Cadastro Único) é um instrumento que identifica e caracteriza as famílias de baixa renda, permitindo que o governo conheça melhor a realidade socioeconômica dessa população. Nele são registradas informações como: características do domicílio, identificação de cada pessoa, escolaridade, situação de trabalho e renda, entre outras. Essas informações são utilizadas pelo Governo Federal, pelos Estados e pelos municípios para implementação de políticas públicas capazes de promover a melhoria da vida dessas famílias. Utilizando como base as informações contidas no Cadastro Único, a API CadÚnico Serviços Dados Familiares tem como finalidade retornar para uma determinada pessoa, a partir do CPF ou NIS: \n \n \nDecreto nº 11.016, de 29 de março de 2022, que regulamenta o Cadastro Único para Programas Sociais do Governo Federal, instituído pelo art. 6º-F da Lei nº 8.742, de 7 de dezembro de 1993.\nPortaria MC nº 810, de 14 de setembro de 2022, que define procedimentos para a gestão, operacionalização, cessão e utilização dos dados do Cadastro Único\nPortaria nº 501, de 29 de novembro de 2017, que disciplina o processo de uso do CadÚnico por órgãos e entidades federais como instrumento de seleção de beneficiários de políticas e programas sociais.\nPortaria nº 502, de 29 de novembro de 2017, que institui a Política de Controle de Acesso aos dados do Cadastro Único para Programas Sociais.\n ", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cadunico-servicos-dados/v1/dp/dadosFamiliar/nis/{nis}", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cadunico-servicos-dados/v1/dp/dadosFamiliar/{cpf}", "https://www.gov.br/conecta/catalogo/apis/cadunico-servicos-dados-familiares/CadUnico_Servicos_Dados_Familiares.json/swagger_view", "https://gerenciador-conecta.readthedocs.io/manual_recebedor_dados.html#roteiro-geracao-chaves-acesso"], "tecnologias": ["JSON"], "tags": ["CADUNICO"], "seguranca": ["SSL"], "hospedagem": ["Dataprev"], "controle-de-acesso": ["OAuth"]},
{"api_name": "Consulta CNPJ", "uuid": "consulta-cnpj", "orgao": "Receita Federal do Brasil (RFB)", "versao": "Versão 2.0.2 - 22/01/2021", "descricao": "O Cadastro Nacional de Pessoas Jurídicas (CNPJ) foi instituído Registro de Referência pela \n, e como tal tem a finalidade de:\nO CNPJ compreende as informações cadastrais de pessoas jurídicas e outros tipos de arranjo jurídico sem personalidade jurídica (como condomínios, órgãos públicos, fundos), ou seja, informações cadastrais das entidades de interesse das administrações tributárias da União, dos Estados, do Distrito Federal e dos Municípios.\nA administração do CNPJ compete à Secretaria Especial da Receita Federal do Brasil (RFB). Foi criado no dia 1º de julho de 1998, por intermédio da Instrução Normativa SRF nº 27/1998 e encontra-se regulamentado pela Instrução Normativa RFB nº 1.863/2018. \nA API Consulta CNPJ disponibiliza três serviços, correspondentes a três tipos de consultas, que se diferenciam pelo número de campos retornados.\n \nO Impacto estimado da Interoperabilidade deste serviço público é de \n.\nPara maiores informações sobre a metodologia de Cálculo de Impacto da Interoperabilidade, acesse:  \n ", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cnpj-empresa/v2/empresa/", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/api-cnpj-empresa/v2/empresa/", "https://www.gov.br/conecta/catalogo/apis/consulta-cnpj/swagger_cnpj.json/swagger_view", "https://gerenciador-conecta.readthedocs.io/manual_recebedor_dados.html#roteiro-geracao-chaves-acesso"], "tecnologias": ["JSON - JavaScript Object Notation"], "tags": ["CNPJ", "RFB"], "seguranca": ["SSL"], "hospedagem": ["Serpro"], "controle-de-acesso": ["OAuth"]},
{"api_name": "Consulta Certidão Negativa de Débitos (CND)", "uuid": "consultar-certidao-negativa-de-debito", "orgao": "Receita Federal do Brasil (RFB)", "versao": "Versão 1.0 - 15/03/2022", "descricao": "A Certidão Negativa de Débitos (CND) é o documento que comprova a regularidade fiscal de Pessoa Física, Jurídica ou de Imóvel Rural perante a Fazenda Nacional para quaisquer fins, expedida conjuntamente pela Secretaria Especial da Receita Federal do Brasil (RFB) e pela Procuradoria-Geral da Fazenda Nacional (PGFN), referente a todos os créditos tributários federais e à Dívida Ativa da União (DAU) por elas administrados. Em outras palavras, ela é um documento emitido pelo governo que atesta que um dado CPF, CNPJ ou imóvel rural está em dia com suas obrigações junto ao Governo Federal. Qualquer pessoa pode emitir ou consultar uma CND, bastando para isso acessar as páginas do Sistema CND.\nO serviço Consulta CND é uma API HTTP REST que permite a um sistema consultar certidões negativas de débito federais (PGFN e RFB) de pessoas jurídicas, pessoas físicas e imóveis rurais diretamente no Sistema CND, sem necessidade de intervenção humana.\nAo receber uma chamada, a API Consulta CND inicialmente valida os parâmetros. Se tudo estiver correto e o identificador (CNPJ, CPF ou NIRF) for válido e existir, a API verifica se existe uma certidão emitida e ainda dentro do período de validade para o identificador informado. Se houver, a API retorna essa certidão e encerra o processo. Se houver mais de uma certidão válida, a API retorna a mais recente, com maior prazo de validade, junto com o status 1. Se não houver uma certidão emitida e dentro do prazo de validade, a API consulta o sistema-pai Certidões Negativas de Débito. Se não houver impedimento para o identificador informado, o Sistem CND emite uma certidão, que a API retorna ao chamador. Toda certidão é emitida com validade de 180 dias. Se não for possível emitir a certidão, a API retorna uma mensagem de erro.", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cnd/v1/ConsultaCnd/certidao"], "tecnologias": ["JSON"], "tags": ["CertidãoNegativaDébito", "ReceitaFederal", "CND"], "seguranca": ["SSL"], "hospedagem": ["SERPRO"], "controle-de-acesso": ["OAuth Certificado Digital"]},
{"api_name": "Metadados Estatísticos do IBGE", "uuid": "metadados-estatisticos-do-ibge", "orgao": "Instituto Brasileiro de Geografia e Estatística (IBGE)", "versao": "Versão 2.0 - 23/10/2018", "descricao": "IBGE-Metadados (APIMETADADOS) tem como finalidade consultar as principais classes de metadados provenientes do Sistema de Metadados Estatísticos do IBGE, como: operação estatística, ocorrência de operação estatística, documentos de referência, variáveis, entre outras.\nDessa forma, os usuários/sistemas poderão recuperar os metadados relacionados a estas classes, bem como os metadados da ficha metodológica que descrevem os objetivos, metas e indicadores da plataforma de Objetivos de Desenvolvimento Sustentável.", "docs": null, "links": ["https://apimetadados.ibge.gov.br/"], "tecnologias": ["SOAP JSON"], "tags": ["Metadados Estatísticos", "IBGE"], "seguranca": ["SSL"], "hospedagem": ["IBGE"], "controle-de-acesso": ["Outro"]},
{"api_name": "Certidão de Quitação Eleitoral", "uuid": "quitacao-eleitoral", "orgao": "Tribunal Superior Eleitoral (TSE)", "versao": "Versão 1.0 - 10/07/2018", "descricao": " \nNa internet, a emissão da certidão é possível se não houver divergência entre os dados informados e os registrados no Cadastro Eleitoral, se não existir restrição no histórico de sua inscrição, tais como faltas não justificadas às eleições ou prestação de contas pendentes - no caso pessoas que foram candidatos em eleições - dentre outras faltas passíveis de multa pela Justiça Eleitoral.\nOs serviços disponibilizados permitem Consultar a situação de Quitação Eleitoral ou Emitir a\nCertidão em em formato PDF.\nO Impacto estimado da Interoperabilidade deste serviço público é de \n.\nPara maiores informações sobre a metodologia de Cálculo de Impacto da Interoperabilidade, acesse:  \n ", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/api-quitacao-eleitoral/v3/eleitores/quitacao-eleitoral", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-quitacao-eleitoral/v2/eleitores/certidao-quitacao-eleitoral", "https://apigateway.conectagov.estaleiro.serpro.gov.br/oauth2/jwt-token", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-quitacao-eleitoral/v3/eleitores/quitacao-eleitoral", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-quitacao-eleitoral/v2/eleitores/certidao-quitacao-eleitoral", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/oauth2/jwt-token", "https://www.gov.br/conecta/catalogo/apis/quitacao-eleitoral/Documentacao-API-Certidao-Quitacao-Eleitoral_v2.pdf/at_download/file", "https://gerenciador-conecta.readthedocs.io/manual_recebedor_dados.html#roteiro-geracao-chaves-acesso"], "tecnologias": ["JSON"], "tags": ["TSE", "Quitação Eleitoral"], "seguranca": ["Outro"], "hospedagem": ["TSE - Tribunal Superior Eleitoral"], "controle-de-acesso": []},
{"api_name": "Certidão de Antecedentes Criminais", "uuid": "antecedentes-criminais", "orgao": "Ministério da Justiça e Segurança Pública – Polícia Federal", "versao": "Versão V1.0", "descricao": " \nO Impacto estimado da Interoperabilidade deste serviço público é de \n.\nPara maiores informações sobre a metodologia de Cálculo de Impacto da Interoperabilidade, acesse:  \n ", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/api-antecedentes-criminais/v1/certidao", "https://apigateway.conectagov.estaleiro.serpro.gov.br/oauth2/jwt-token", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/oauth2/jwt-token", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-antecedentes-criminais/v1/certidao", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/oauth2/jwt-token", "https://www.gov.br/conecta/catalogo/apis/antecedentes-criminais/et-especificacao_tecnica-sincac-1-2-pdf/at_download/file", "https://gerenciador-conecta.readthedocs.io/manual_recebedor_dados.html#roteiro-geracao-chaves-acesso"], "tecnologias": ["SOAP / XML"], "tags": ["SINCAC", "SINIC", "AntecedentesCriminais"], "seguranca": ["SSL"], "hospedagem": ["Polícia Federal"], "controle-de-acesso": ["Outro"]},
{"api_name": "Ações de Aprendizagem", "uuid": "acoes-de-aprendizagem", "orgao": "ENAP - Escola Nacional de Administração Pública", "versao": "Versão 1.0 - 12/07/2023", "descricao": "Permite consultar as ações de aprendizagem concluídas, ministradas e recomendada para o CPF informado.", "docs": null, "links": [], "tecnologias": ["JSON"], "tags": ["ENAP", "Educação", "Formação"], "seguranca": ["SSL"], "hospedagem": ["Infraestrutura do próprio órgão."], "controle-de-acesso": ["OAuth API Keys"]},
{"api_name": "WSDenatran - Veículos, Condutores e Infrações", "uuid": "wsdenatran", "orgao": "Ministério da Infraestrutura – Denatran", "versao": "Não informado", "descricao": "O serviço WSDenatran (Consulta On-line Denatran) é um serviço de integração entre sistemas, que possibilita o acesso às informações oficiais dos sistemas de trânsito do Denatran, sobre veículos (Renavam), condutores (Renach) e infrações (Renainf). Essa API é fornecida mediante termo de autorização realizado no Denatran e contração do consulta online com o SERPRO.", "docs": null, "links": ["https://ec9d5935-bd70-4d66-b773-81b5b12391fc.filesusr.com/ugd/0c39b9_b3f4794898184ff8958c6911afdba6cf.pdf"], "tecnologias": ["REST / JSON"], "tags": ["SERPRO", "WSDenatran", "DENATRAN", "Renainf", "Renach", "Renavam"], "seguranca": ["SSL"], "hospedagem": ["SERPRO"], "controle-de-acesso": ["Certificado Digital"]},
{"api_name": "Avaliação da Satisfação com Serviços Públicos Digitais", "uuid": "avaliacao-de-servicos-publicos-digitais", "orgao": "Ministério da Gestão e da Inovação em Serviços Públicos - Secretaria de Governo Digital (MGISP/SGD)", "versao": "Versão 2.0 - 31/12/2019", "descricao": "Esta API é responsável por disponibilizar a avaliação de satisfação com os Serviços Públicos Digitais\nO Decreto nº 8936/2016, instituiu a Plataforma de Cidadania Digital e dispôs sobre a oferta dos serviços públicos digitais, no âmbito dos órgãos e das entidades da administração pública federal direta, autárquica e fundacional.  No seu artigo 3º, incisos IV e V foi instituído a ferramenta de avaliação da satisfação dos usuários em relação aos serviços públicos prestados e o painel de monitoramento do desempenho dos serviços públicos prestados.\n ", "docs": null, "links": ["https://avaliacao.servicos.gov.br/api/avaliacao/", "https://manual-avaliacao.readthedocs.io/pt_BR/latest/acessoasapis.html", "https://manual-avaliacao.readthedocs.io/pt_BR/latest/", "https://acompanhamento.servicos.gov.br/api/acompanhamento/swagger-ui.html"], "tecnologias": ["REST / JSON"], "tags": ["Avaliação", "Portal de Serviços"], "seguranca": ["SSL"], "hospedagem": ["Ministério da Economia"], "controle-de-acesso": ["HTTP Basic"]},
{"api_name": "Acompanhamento de Serviço Público Digital", "uuid": "acompanhamento-de-servico-publico-digital", "orgao": "Ministério da Gestão e da Inovação em Serviços Públicos - Secretaria de Governo Digital (MGISP/SGD)", "versao": "Versão 2.0 - 31/12/2019", "descricao": "Esta API é responsável por monitorar as etapas de atendimento dos Serviços Digitais e o tempo de cada uma delas.\nO Decreto nº 8936/2016 instituiu a Plataforma de Cidadania Digital e dispôs sobre a oferta dos serviços públicos digitais, no âmbito dos órgãos e das entidades da administração pública federal direta, autárquica e fundacional.  No seu artigo 3º, incisos IV e V foi instituído a ferramenta de avaliação da satisfação dos usuários em relação aos serviços públicos prestados e o painel de monitoramento do desempenho dos serviços públicos prestados.\n ", "docs": null, "links": ["https://acompanhamento.servicos.gov.br/api/acompanhamento/", "https://manual-avaliacao.readthedocs.io/pt_BR/latest/acessoasapis.html", "https://manual-avaliacao.readthedocs.io/pt_BR/latest/", "https://acompanhamento.servicos.gov.br/api/acompanhamento/swagger-ui.html"], "tecnologias": ["PHP / JSON"], "tags": ["Portal de Serviços"], "seguranca": ["SSL"], "hospedagem": ["Ministério da Economia"], "controle-de-acesso": ["HTTP Basic"]},
{"api_name": "SIOP - Gestão de Credencial de Acesso", "uuid": "gestao-de-credencial-de-acesso", "orgao": "Versão 1.0 - 15/10/2018", "versao": "Não informado", "descricao": "", "docs": null, "links": ["https://webservice.siop.gov.br/services/credencial/WSCredencial?wsdl", "https://www1.siop.planejamento.gov.br/siopdoc/doku.php/webservices:manual-wscredencial"], "tecnologias": ["SOAP XML"], "tags": ["Ministério da Economia (ME)", "SIOP", "Credencial de Acesso"], "seguranca": ["SSL"], "hospedagem": ["Ministério da Economia (ME)"], "controle-de-acesso": ["Certificado Digital"]},
{"api_name": "Receitas do SIOP", "uuid": "receitas-do-siop", "orgao": "Ministério da Economia – Secretaria de Orçamento Federal (ME/SOF)", "versao": "Não informado", "descricao": "", "docs": null, "links": ["https://webservice.siop.gov.br/services/WSReceita?wsdl", "https://www1.siop.planejamento.gov.br/siopdoc/doku.php/webservices:manual-wsreceita"], "tecnologias": ["SOAP XML"], "tags": ["Ministério da Economia (ME)", "SIOP", "Receitas"], "seguranca": ["SSL"], "hospedagem": ["Ministério da Economia"], "controle-de-acesso": ["Certificado Digital"]},
{"api_name": "Quantitativo do SIOP", "uuid": "wsquantitativo-do-siop", "orgao": "Ministério da Economia – Secretaria de Orçamento Federal (ME/SOF)", "versao": "Não informado", "descricao": "Esta API possibilita operações para consulta e cadastro. Inclui também operações para tratar Acompanhamento Orçamentário e Execução Financeira do SIAFI.", "docs": null, "links": ["https://webservice.siop.gov.br/services/WSQuantitativo?wsdl", "https://www1.siop.planejamento.gov.br/siopdoc/doku.php/webservices:manual-wsquantitativo"], "tecnologias": ["SOAP / XML"], "tags": ["Ministério da Economia (ME)", "SIOP", "Proposta Quantitativa Orçamentária"], "seguranca": ["SSL"], "hospedagem": ["Ministério da Economia"], "controle-de-acesso": ["Certificado Digital"]},
{"api_name": "Qualitativo do SIOP", "uuid": "qualitativo-do-siop", "orgao": "Ministério da Economia – Secretaria de Orçamento Federal (ME/SOF)", "versao": "Não informado", "descricao": "", "docs": null, "links": ["https://webservice.siop.gov.br/services/WSQualitativo?wsdl", "https://www1.siop.planejamento.gov.br/siopdoc/doku.php/webservices:manual-wsqualitativo"], "tecnologias": ["SOAP / XML"], "tags": ["Qualitativo", "SIOP", "Ministério da Economia"], "seguranca": ["SSL"], "hospedagem": ["Ministério da Economia"], "controle-de-acesso": ["Certificado Digital"]},
{"api_name": "Precatórios do SIOP", "uuid": "precatorios-do-siop", "orgao": "Ministério da Economia – Secretaria de Orçamento Federal (ME/SOF)", "versao": "Não informado", "descricao": "", "docs": null, "links": ["https://webservice.siop.gov.br/services/precatorios/WSPrecatorios?wsdl", "https://www1.siop.planejamento.gov.br/siopdoc/doku.php/webservices:manual-wsprecatorios."], "tecnologias": ["SOAP XML"], "tags": ["Ministério da Economia (ME)", "SIOP", "Precatórios"], "seguranca": ["SSL"], "hospedagem": ["Ministério da Economia"], "controle-de-acesso": ["Certificado Digital"]},
{"api_name": "Monitoramento do PPA", "uuid": "monitoramento-do-ppa", "orgao": "Ministério da Economia – Secretaria de Orçamento Federal (ME/SOF)", "versao": "Não informado", "descricao": "Esta API disponibiliza informações do Monitoramento do PPA.", "docs": null, "links": ["https://www.siop.planejamento.gov.br/services/WSMonitoramento?wsdl", "https://www1.siop.planejamento.gov.br/siopdoc<i></i>"], "tecnologias": ["SOAP / XML"], "tags": ["Ministério da Economia (ME)", "SIOP", "Monitoramento"], "seguranca": ["SSL"], "hospedagem": ["Ministério da Economia"], "controle-de-acesso": ["Certificado Digital"]},
{"api_name": "Avaliação do PPA", "uuid": "avaliacao", "orgao": "Ministério da Economia – Secretaria de Orçamento Federal (ME/SOF)", "versao": "Não informado", "descricao": "Esta API tem por objetivo disponibilizar informações da Avaliação do PPA.", "docs": null, "links": ["https://www.siop.planejamento.gov.br/services/WSAvaliacao?wsdl"], "tecnologias": ["SOAP XML"], "tags": ["Ministério da Economia (ME)", "SIOP", "Avaliação"], "seguranca": ["SSL"], "hospedagem": ["Ministério da Economia"], "controle-de-acesso": ["Certificado Digital"]},
{"api_name": "Emendas Individuais SIOP", "uuid": "emendas-individuais-siop", "orgao": "Ministério da Economia – Secretaria de Orçamento Federal (ME/SOF)", "versao": "Versão V2.0", "descricao": "Esta API possibilita operações de consulta de informações das Emendas Individuais dos Parlamentares, de cadastro e acompanhamento Pedidos de alterações Qualitativas e Quantitativas relativas a Emendas Individuais, assim como Pedidos de Saneamento de Impedimentos de Emendas Individuais. É possível também cadastrar e priorizar beneficiários das Emendas Individuais e seus impedimentos.\nDestina-se a Ministérios que precisam fazer alterações orçamentárias em Emendas Individuais em grande quantidade.", "docs": null, "links": ["https://siop.planejamento.gov.br/modulo/itens/api", "https://www1.siop.planejamento.gov.br/siopdoc/doku.php/api:impositivo"], "tecnologias": ["Arquitetura de Microserviços / GraphQL"], "tags": ["EmendasIndividuais", "SIOP", "SOF"], "seguranca": [], "hospedagem": ["Ministério da Economia"], "controle-de-acesso": ["HTTP Basic"]},
{"api_name": "Consulta Execução Orçamentária SIOP", "uuid": "consulta-execucao-orcamentaria", "orgao": "Ministério da Economia – Secretaria de Orçamento Federal (ME/SOF)", "versao": "Versão 1.0 - 15/10/2018", "descricao": "", "docs": null, "links": ["https://webservice.siop.gov.br/services/WSExecucaoOrcamentaria?wsdl", "https://www1.siop.planejamento.gov.br/siopdoc/doku.php/webservices:manual-wsexecucaoorcamentaria"], "tecnologias": ["SOAP XML"], "tags": ["Ministério da Economia (ME)", "SIOP", "Execução Orçamentária"], "seguranca": ["SSL"], "hospedagem": ["Ministério da Economia"], "controle-de-acesso": ["Certificado Digital"]},
{"api_name": "Alterações Orçamentárias SIOP", "uuid": "alteracoes-orcamentarias", "orgao": "Ministério da Economia – Secretaria de Orçamento Federal (ME/SOF)", "versao": "Não informado", "descricao": " ", "docs": null, "links": ["https://siop.planejamento.gov.br/services/WSAlteracoesOrcamentarias?wsdl", "https://www1.siop.planejamento.gov.br/siopdoc/doku.php/webservices:manual-wsalteracoesorcamentarias"], "tecnologias": ["SOAP / XML"], "tags": ["Ministério da Economia (ME)", "SIOP", "Alterações Orçamentárias"], "seguranca": ["SSL"], "hospedagem": ["Ministério da Economia"], "controle-de-acesso": ["Certificado Digital"]},
{"api_name": "Acompanhamento da Execução das Empresas Estatais - SIOP", "uuid": "acompanhamento-da-execucao-das-empresas-estatais", "orgao": "Ministério da Economia – Secretaria de Orçamento Federal (ME/SOF)", "versao": "Não informado", "descricao": "Esta API contempla serviços que permitem o cadastramento e a consulta dos dados de execução mensal das empresas estatais.", "docs": null, "links": ["https://webservice.siop.gov.br/services/WSExecucaoEstatais?wsdl", "https://www1.siop.planejamento.gov.br/siopdoc/doku.php/webservices:manual-wsexecucaoestatais"], "tecnologias": ["SOAP XML"], "tags": ["Ministério da Economia (ME)", "SIOP", "Empresas Estatais"], "seguranca": ["SSL"], "hospedagem": ["Ministério da Economia"], "controle-de-acesso": ["Certificado Digital"]},
{"api_name": "SISGRU - Guia de Recolhimento da União", "uuid": "sisgru-guia-de-recolhimento-da-uniao", "orgao": "Ministério da Fazenda - Secretaria do Tesouro Nacional (MF/STN)", "versao": "Versão V1.0", "descricao": "", "docs": null, "links": ["https://webservice.sisgru.tesouro.gov.br/sisgru/services/v1/grus", "https://webservice.sisgru.tesouro.gov.br/sisgru/services/v1/docs/sisgru_ws_specs.html"], "tecnologias": ["REST / XML"], "tags": ["STN", "GRU"], "seguranca": ["SSL"], "hospedagem": ["SERPRO"], "controle-de-acesso": ["HTTP Basic"]},
{"api_name": "SIAFI - Manter Programação", "uuid": "manter-programacao", "orgao": "Ministério da Fazenda - Secretaria do Tesouro Nacional (MF/STN)", "versao": "Versão V1 - 18/09/2018", "descricao": "Esta API realiza as seguintes operações:\n \n ", "docs": null, "links": ["https://servicos-siafi.tesouro.gov.br/siafi2020/services/pf/manterProgramacaoFinanceira"], "tecnologias": ["SOAP / XML"], "tags": ["STN", "SIAFI"], "seguranca": ["SSL"], "hospedagem": ["Secretaria do Tesouro Nacional"], "controle-de-acesso": ["Certificado Digital Outro"]},
{"api_name": "SIAFI – Módulo Orçamentário", "uuid": "siafi-2013-modulo-orcamentario", "orgao": "Ministério da Economia – Secretaria do Tesouro Nacional (ME/STN)", "versao": "Versão V1.5 - 04/11/2021", "descricao": "A API SIAFI – Módulo Orçamentário tem a finalidade de oferecer uma maneira mais eficiente para as Unidades Gestoras do Governo Federal realizarem suas despesas, por meio das Operações de Empenho e Pre-empenho, de forma integrada ao SIAFI WEB.", "docs": null, "links": ["https://servicos-siafi.tesouro.gov.br/siafi/services/orcamentario/ manterOrcamentario?", "https://sisweb.tesouro.gov.br/apex/f?p=2501:9::::9:P9_ID_PUBLICACAO_ANEXO:15346"], "tecnologias": ["SOAP / XML"], "tags": ["STN", "SIAFI", "EMPENHO"], "seguranca": ["WS-Security"], "hospedagem": ["SERPRO"], "controle-de-acesso": ["Certificado Digital"]},
{"api_name": "SICONFI - Extratos das declarações contábeis", "uuid": "siconfi-extratos-das-declaracoes-contabeis", "orgao": "Ministério da Economia – Secretaria do Tesouro Nacional (ME/STN)", "versao": "Versão Beta 1.1.0 - 22/09/2020", "descricao": "Informações contábeis dos entes federativos: relatórios RREO (Relatório Resumido da Execução Orçamentária), RGF (Relatório de Gestão Fiscal), DCA (Balanço Anual), MSC (Matriz de Saldos Contábeis) e seus anexos, além dos extratos de entregas desses relatórios.\nA API consulta o Sistema de Informações Contábeis e Fiscais do Setor Público Brasileiro - SICONFI, ferramenta destinada ao recebimento de informações contábeis, financeiras e de estatísticas fiscais oriundas de municípios, estados, o DF e União, e o uso destina-se tanto aos entes federados quanto à sociedade civil.", "docs": null, "links": ["http://apidatalake.tesouro.gov.br/docs/siconfi/", "http://apidatalake.tesouro.gov.br/docs/siconfi/", "https://siconfi.tesouro.gov.br/siconfi/pages/public/faq_view.jsf"], "tecnologias": ["API REST/XML"], "tags": ["STN"], "seguranca": ["Outro"], "hospedagem": ["Secretaria do Tesouro Nacional"], "controle-de-acesso": ["Livre"]},
{"api_name": "SIAFI - Manter Contas a Pagar e Receber", "uuid": "novo-siafi-manter-contas-a-pagar-e-receber", "orgao": "Ministério da Economia – Secretaria do Tesouro Nacional (ME/STN)", "versao": "Versão 1 - 18/09/2018", "descricao": "A API  SIAFI - Manter Contas a Pagar e Receber tem a finalidade de oferecer uma maneira mais eficiente para as Unidades Gestoras do Governo Federal realizarem suas receitas e despesas, com maior aderência às normas vigentes e maior controle sobre as fases de execução e sobre os saldos disponíveis, de forma integrada ao SIAFI WEB.\nEsta API realiza as seguintes operações:", "docs": null, "links": ["https://servicos-siafi.tesouro.gov.br/siafi2020/services/cpr/manterContasPagarReceber"], "tecnologias": ["SOAP / XML"], "tags": ["STN", "SIAFI"], "seguranca": ["SSL"], "hospedagem": ["Secretaria do Tesouro Nacional"], "controle-de-acesso": ["Certificado Digital Outro"]},
{"api_name": "SIAFI - Consultar Tabelas Administrativas", "uuid": "consultar-tabelas-administrativas-do-siafi", "orgao": "Ministério da Economia – Secretaria do Tesouro Nacional (ME/STN)", "versao": "Versão 1.0 - 18/09/2018", "descricao": "Esta API permite a Consulta às Tabelas Administrativas do SIAFI e suas respectivas operações", "docs": null, "links": ["https://servicos-siafi.tesouro.gov.br/siafi2020/services/tabelas/consultarTabelasAdministrativas"], "tecnologias": ["SOAP XML"], "tags": ["STN", "SIAFI"], "seguranca": ["WS-Security"], "hospedagem": ["STN"], "controle-de-acesso": ["Certificado Digital Outro"]},
{"api_name": "SADIPEM - Sistema de Análise da Dívida Pública, Operações de Crédito e Garantias da União, Estados e Municípios", "uuid": "sadipem-sistema-de-analise-da-divida-publica-operacoes-de-credito-e-garantias-da-uniao-estados-e-municipios", "orgao": "Ministério da Economia – Secretaria do Tesouro Nacional (ME/STN)", "versao": "Versão V1 - 22/09/2020", "descricao": "", "docs": null, "links": ["http://apidatalake.tesouro.gov.br/docs/sadipem", "http://apidatalake.tesouro.gov.br/docs/sadipem"], "tecnologias": ["API REST/XML"], "tags": ["STN"], "seguranca": ["Nenhum"], "hospedagem": ["Secretaria do Tesouro Nacional"], "controle-de-acesso": ["Livre"]},
{"api_name": "PagTesouro  -  Órgãos Arrecadadores", "uuid": "pagtesouro-prestador-de-servico-de-pagamento", "orgao": "Ministério da Economia – Secretaria do Tesouro Nacional (ME/STN)", "versao": "Versão 3.0", "descricao": "O PagTesouro é a plataforma digital para pagamento e recolhimento de valores à Conta Única do Tesouro Nacional. Atua no cenário de recolhimento de receitas de Órgãos Públicos Federais como taxas (custas judiciais, emissão de passaporte etc), aluguéis de imóveis públicos, serviços administrativos e educacionais, multas, entre outros, permitindo o pagamento em forma digital, assim como a impressão do boleto de pagamento.\nO serviço cujo pagamento será realizado utilizando o PagTesouro, deverá ser cadastrado no SISGRU, momento em que será gerado um código identificador para o serviço. O SISGRU – Sistema de Gestão de Recolhimentos da União é acessado pelos usuários das unidades gestoras utilizando as mesmas credenciais de acesso ao SIAFI – Sistema Integrado de Administração Financeira.", "docs": null, "links": ["https://pagtesouro.tesouro.gov.br", "https://valpagtesouro.tesouro.gov.br/simulador/#/pages/api", "https://pagtesouro.tesouro.gov.br/docs/orgao"], "tecnologias": ["REST / JSON"], "tags": ["STN", "PagTesouro", "GRU"], "seguranca": ["SSL"], "hospedagem": ["Serpro"], "controle-de-acesso": ["API Keys"]},
{"api_name": "PagTesouro  -  Prestadores de Serviços de Pagamentos", "uuid": "pagtesouro", "orgao": "Ministério da Fazenda - Secretaria do Tesouro Nacional (MF/STN)", "versao": "Versão V1.1 - 10/08/2020", "descricao": "O PagTesouro é a plataforma digital para pagamento e recolhimento de valores à Conta Única do Tesouro Nacional.\n Por meio da plataforma, as empresas prestadoras de serviços de pagamentos poderão realizar o recolhimento dos valores por meio de: credenciamento prévio junto à Secretaria do Tesouro Nacional da Secretaria Especial de Fazenda do Ministério da Economia; e integração de sua solução tecnológica ao PagTesouro.  A empresa prestadora de serviços de pagamentos deverá ter autorização do Banco Central para operar. \nAdesão dos Prestadores de Serviços de Pagamento (PSPs) ao Modelo de Credenciamento do sistema PagTesouro, instituído pela Secretaria do Tesouro Nacional (STN), tendo como principal objetivo o pagamento das \n pelos contribuintes de forma digital como, por exemplo, via cartão de crédito.\nEsta API destina-se aos Prestadores de Serviço de Pagamento.", "docs": null, "links": ["https://pagtesouro.tesouro.gov.br", "https://pagtesouro.tesouro.gov.br/docs/psp", "https://pagtesouro.tesouro.gov.br/docs/api-psp/"], "tecnologias": ["REST / JSON"], "tags": ["STN", "PagTesouro", "GRU"], "seguranca": ["SSL"], "hospedagem": ["SERPRO"], "controle-de-acesso": ["Outro"]},
{"api_name": "Integra Siafi – Nota de Crédito e de Dotação", "uuid": "integra-siafi", "orgao": "Ministério da Economia – Secretaria do Tesouro Nacional (ME/STN)", "versao": "Versão v1.0 - 20/08/2018", "descricao": "", "docs": null, "links": ["https://apigateway.serpro.gov.br/api-siafi/1.0.0", "https://www.tesouro.fazenda.gov.br/pt/webservices", "https://devserpro.github.io/apiserpro/apis/swagger-ui-master/dist/index.html?bearer=4e1a1858bdd584fdc077fb7d80f39283&url=https://devserpro.github.io/apiserpro/apis/swaggers/siafi/swagger-siafi-trial-bsa.json#!/Nota_de_Dota%C3%A7%C3%A3o/get_v2_nota_dotacao_ug_gestao_ano_numero"], "tecnologias": ["REST / JSON"], "tags": ["STN", "SIAFI"], "seguranca": ["SSL"], "hospedagem": ["SERPRO"], "controle-de-acesso": ["API Keys"]},
{"api_name": "Consulta Dívida Ativa da União", "uuid": "consulta-divida-ativa-da-uniao", "orgao": "Procuradoria-Geral da Fazenda Nacional (PGFN)", "versao": "Versão 1.0 - 10/04/2018", "descricao": "A Dívida Ativa da União é um cadastro mantido pelo Governo Federal através da Procuradoria Geral da Fazenda Nacional - PGFN, utilizado para inscrever pessoas físicas ou jurídicas com débitos de natureza tributária e não-tributária, cuja titularidade do crédito seja da Fazenda Pública Nacional, conforme definido no art. 39 da Lei n° 4.320, de 17 de março de 1964, ou débitos de natureza não tributária, que não sejam de titularidade da Fazenda Pública Nacional, mas que por disposição de lei administra o cadastro em dívida ativa, como é exemplo o FGTS, conforme disposto no art. 2º da Lei n.° 8.844 de 20 de janeiro de 1994.\nA API “Dívida Ativa da União” tem como finalidade consultar de forma automática se uma pessoa física ou jurídica está inscrita no cadastro de Dívida Ativa da União, recebendo como parâmetro de entrada o CPF ou CNPJ, retornando valores referentes à inscrição no cadastro como por exemplo valor, origem, vencimento, e fundamento legal da dívida.\nAs informações sobre a dívida ativa da união são publicadas trimestralmente em dados abertos pela PGFN, conforme disposto na Portaria PGFN nº 636, de 9 de janeiro de 2020, porém, a utilização da API para a automatização das consultas pode significar um considerável ganho de tempo e recursos na execução da tarefa.", "docs": null, "links": ["https://gateway.apiserpro.serpro.gov.br/consulta-divida-ativa-df/api", "https://apicenter.estaleiro.serpro.gov.br/documentacao/consulta-divida-ativa/pt/"], "tecnologias": ["HTTP REST"], "tags": [], "seguranca": [], "hospedagem": [], "controle-de-acesso": []},
{"api_name": "Gestão de Créditos - Dívida Ativa", "uuid": "gestao-de-creditos-divida-ativa", "orgao": "Advocacia-Geral da União (AGU)", "versao": "Versão 1.0 - 10/05/2018", "descricao": "O sistema Sapiens Dívida oferta um catálogo de serviços abertos de interoperabilidade para o gerenciamento da dívida a usuários externos das autarquias, fundações públicas federais e órgãos da administração direta. Através de tais serviços, os entes representados podem realizar, de forma eletrônica, o cadastro, a atualização, a extinção, e a consulta periódica de seus créditos.\nA API é destinada às autarquias e fundações públicas federais que possuem dívidas para inscrição na Dívida Ativa da União.", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/api-divida/v1/divida"], "tecnologias": ["SOAP"], "tags": ["Advocacia-Geral da União (AGU)", "GestãodeCréditos", "SapiensDívida"], "seguranca": ["SSL"], "hospedagem": ["Infraestrutura do próprio órgão"], "controle-de-acesso": ["Outro"]},
{"api_name": "API CADIN CREDORA", "uuid": "api-cadin-credora", "orgao": "PGFN/PGDAU", "versao": "Versão 1.0 - 01/08/2023", "descricao": "Api para gerenciamento de cadastro para acesso por entidades credoras", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/oauth2/jwt-token", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/oauth2/jwt-token", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cadin-consulta-contratante/v1", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cadin-consulta-contratante/v1", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cadin-consulta-credora/v1", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cadin-consulta-credora/v1", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cadin-consulta-contratante/v1", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cadin-consulta-contratante/v1", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/api-cadin-consulta-credora/v1", "https://gerenciador-conecta.readthedocs.io/outras_informacoes_tecnicas.html"], "tecnologias": ["JSON"], "tags": ["ConsultaCadin", "Cadin"], "seguranca": ["SSL"], "hospedagem": ["SERPRO"], "controle-de-acesso": ["Outro"]},
{"api_name": "API CADIN CONSULTA / CONTRATANTE ", "uuid": "api-cadin-consulta-contratante", "orgao": "PGFN/PGDAU", "versao": "Versão 1.0  - 01/08/2023", "descricao": "", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/oauth2/jwt-token", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/oauth2/jwt-token", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cadin-consulta-contratante/v1", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cadin-consulta-contratante/v1", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cadin-consulta-credora/v1", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cadin-consulta-credora/v1", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cadin-consulta-contratante/v1", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cadin-consulta-contratante/v1", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/api-cadin-consulta-credora/v1", "https://gerenciador-conecta.readthedocs.io/outras_informacoes_tecnicas.html"], "tecnologias": ["JSON"], "tags": ["ConsultaCadin", "Cadin"], "seguranca": ["SSL"], "hospedagem": ["SERPRO"], "controle-de-acesso": ["Outro"]},
{"api_name": "SIAPE Ocorrências - Servidores Públicos Federais", "uuid": "siape-ocorrencias", "orgao": "Ministério da Gestão e da Inovação em Serviços Públicos - Secretaria de Gestão de Pessoas e Relações de Trabalho (MGI/SGPRT)", "versao": "Versão 1.0 - 14/04/2021", "descricao": "O Objetivo da API de Ocorrências do SIAPE é permitir o envio dos dados de afastamentos e ocorrências dos Servidores de forma automatizada.\nO controle eletrônico de frequência dos servidores públicos federais na Administração Pública Federal direta, autárquica e fundacional, integrantes do SIPEC, surgiu com a publicação do Decreto nº 1.867, de 17 de abril 1996. Em 12 de setembro de 2018 com a publicação da Instrução Normativa nº 2 da SGP, foram estabelecidos critérios, orientações, e procedimentos gerais a serem observados pelos órgãos.\nEm complemento foi publicada a Instrução Normativa \nnº 125, de 3 de dezembro de 2020 reforçando que os órgãos e entidades do SIPEC, obrigatoriamente, devem utilizar sistema informatizado para controle de ponto, podendo adotar um sistema próprio ou utilizar um sistema disponibilizado pelo Órgão Central do SIPEC. ", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/api-ocorrencias/v1/ocorrencias", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/api-ocorrencias/v1/ocorrencias", "https://www.gov.br/conecta/catalogo/apis/siape-ocorrencias/DOC-CGGPP-Guia%20de%20integracao%20dos%20Sistemas%20Eletronicos%20de%20Frequencia%20com%20SIAPE_v1.9.pdf/at_download/file"], "tecnologias": ["SOAP / XML"], "tags": ["Ministério da Gestão e da Inovação em Serviços Públicos", "SIAPE", "Servidor Público"], "seguranca": ["SSL"], "hospedagem": ["SERPRO"], "controle-de-acesso": ["OAuth"]},
{"api_name": "Portal da Transparência do Governo Federal", "uuid": "portal-da-transparencia-do-governo-federal", "orgao": "Controladoria Geral da União (CGU)", "versao": "Versão 1.30.0 - 10/07/2020", "descricao": "Disponibiliza os dados publicados no Portal da Transparência do Governo Federal contendo informações sobre sobre Acordos de Leniência, Auxílio Emergencial, Benefício de Prestação Continuada (BPC), Bolsa Família, Cadastro de Expulsões da Administração Federal (CEAF), Cadastro Nacional de Empresas Inidôneas e Suspensas (CEIS), Cadastro Nacional de Empresas Punidas (CNEP), Contratos do Poder Executivo Federal, Convênios do Poder Executivo Federal, Despesas Públicas, Emendas parlamentares, Entidades Privadas sem Fins Lucrativos Impedidas (CEPIM), Garantia-Safra, Gastos por meio de cartão de pagamento, Licitações do Poder Executivo Federal, Programa de Erradicação do Trabalho Infantil (Peti), Seguro Defeso, Servidores do Poder Executivo Federal e  Viagens a serviço.", "docs": null, "links": ["Detalhamento Técnico Endpoint Produção:\thttp://www.portaldatransparencia.gov.br/api-de-dados/*", "http://www.portaldatransparencia.gov.br/swagger-ui.html"], "tecnologias": ["JSON"], "tags": ["CGU", "TransparênciaPública", "ContraldoriaGeraldaUnião", "PortaldaTransparência"], "seguranca": ["Nenhum"], "hospedagem": ["Embratel"], "controle-de-acesso": ["API Keys"]},
{"api_name": "Publicar no Diário Oficial da União - DOU", "uuid": "publicar-no-dou", "orgao": "Imprensa Nacional", "versao": "Versão 1.0 - 11/10/2018", "descricao": "A imprensa Nacional disponibiliza o WS-INCom, para envio de matérias para publicação no Diário Oficial da União(DOU).", "docs": null, "links": ["http://portal.imprensanacional.gov.br/web/guest/publicacao-de-materias-via-web-service-ws-incom#Passos_para_ter_o_acesso_ao_Webservice_da_IN"], "tecnologias": ["SOAP JSON"], "tags": ["DOU", "Imprensa Nacional"], "seguranca": ["Outro"], "hospedagem": ["Imprensa Nacional"], "controle-de-acesso": ["Outro"]},
{"api_name": "Sistema e-Aud de Auditorias da CGU", "uuid": "sistema-e-aud-de-auditorias-da-cgu", "orgao": "Controladoria Geral da União (CGU)", "versao": "Não informado", "descricao": "Disponibiliza informações e transações para os dados de Auditorias da CGU.  Sistema e-Aud em API-REST.\nConsultas de Tarefas do e-Aud.\nConsulta de Relatórios publicados da CGU\nConsulta de Monitoramentos de Recomendações da CGU.\nOperações sobre tarefas do Sistema.", "docs": null, "links": ["https://eaud.cgu.gov.br/", "https://eaud.cgu.gov.br/swagger-ui.html"], "tecnologias": ["JSON"], "tags": ["CGU", "eaud", "e-aud", "auditoria"], "seguranca": ["SSL"], "hospedagem": ["CGU"], "controle-de-acesso": ["API Keys"]},
{"api_name": "Polímero - Composição Societária dos Agentes do Setor Elétrico", "uuid": "polimero", "orgao": "Agência Nacional de Energia Elétrica (ANEEL)", "versao": "Versão 1.0 - 31/05/2022", "descricao": "A \n é um webservice que permite consultar informações sobre cadeia societária que estão registradas no Sistema Polímero. \nOs agentes do Setor Elétrico devem informar à ANEEL, por meio do sistema Polímero, a composição societária de seus empreendimentos por meio do preenchimento dos sistemas disponibilizados pela Agência. \nA regulação Econômico-Financeira foi aprovada pela Resolução Normativa ANEEL nº 948, de 16/11/2021. Conforme art. 4º do Módulo II do Anexo a essa Norma, enviar à Superintendência de Fiscalização Econômica, Financeira e de Mercado (SFF)1, informação atualizada relativa à respectiva composição societária na concretização da operação de transferência acionária, periodicamente e no último dia de cada trimestre civil. Na ocasião, deve identificar o grupo de controle e explicitar todas as participações societárias diretas e indiretas dos respectivos controladores.\nA obrigatoriedade de informar à ANEEL qualquer alteração na composição societária também é mencionado no inciso XX do art. 2º da Resolução Normativa ANEEL nº 921, de 23 de fevereiro de 2021, a qual estabelece os deveres, direitos e outras condições gerais aplicáveis às outorgas de autorizações a pessoas jurídicas, físicas ou empresas reunidas em consórcio interessadas em se estabelecerem como Produtores Independentes de Energia Elétrica ou Autoprodutores de Energia de Elétrica, tendo por objeto a implantação ou a exploração de central geradora de energia elétrica.\nPara saber mais, consulte: \n ", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/api-polimero/v1/Consulta/ObterCadeiaSocietariaSemCpf", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-polimero/v1/Consulta/ObterCadeiaSocietaria"], "tecnologias": [".Net Core 5.0 / JSON"], "tags": ["ANEEL", "CadeiaSocietaria", "Agentes", "SetorEletrico", "Socio"], "seguranca": ["SSL"], "hospedagem": ["Serpro"], "controle-de-acesso": []},
{"api_name": "vLibras - Língua Brasileira de Sinais", "uuid": "vlibras", "orgao": "Ministério da Economia (ME)", "versao": "Versão 1.0 - 25/10/2018", "descricao": " \n ", "docs": null, "links": [], "tecnologias": ["REST"], "tags": [], "seguranca": ["Nenhum"], "hospedagem": ["Ministério da Economia (ME)"], "controle-de-acesso": []},
{"api_name": "Outorgas de Geração", "uuid": "outorga", "orgao": "Agência Nacional de Energia Elétrica (ANEEL)", "versao": "Versão 5.6 - 31/07/2020", "descricao": "Permitir consultar dados dos empreendimentos outorgados de geração. Através do código do empreendimento (CEG) consegue-se todas as informações detalhadas da usina.", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/oauth2/jwt-token", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-outorgas/v1/ConsultaDadosUsina", "http://servicos.aneel.gov.br/", "https://gerenciador-conecta.readthedocs.io/manual_recebedor_dados.html#roteiro-geracao-chaves-acesso"], "tecnologias": ["REST JSON"], "tags": ["ANEEL", "OUTORGAS"], "seguranca": ["SSL"], "hospedagem": ["ANEEL"], "controle-de-acesso": ["OAuth"]},
{"api_name": "Consultar Ato de Concentração", "uuid": "consultar-ato-de-concentracao", "orgao": "Conselho Administrativo de Defesa Econômica (CADE)", "versao": "Versão v. 1.0.0 - 10/06/2021", "descricao": "A API realiza a consulta de Atos de Concentração (Fusões ou Aquisições) no âmbito do CADE.", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/oauth2/jwt-token", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-ato-concentracao/v1/ato-concentracao/findByDocumento/:cpfOuCpnjSomenteNumeros", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/oauth2/jwt-token", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/api-ato-concentracao/v1/ato-concentracao/findByDocumento/:cpfOuCpnjSomenteNumeros", "https://apis.cade.gov.br", "https://hom-apis.cade.gov.br"], "tecnologias": ["JSON"], "tags": ["Conselho Administrativo de Defesa Econômica (CADE)", "ServiçosDigitais", "CADE"], "seguranca": ["SSL"], "hospedagem": ["Infraestrutura do próprio do órgão (CADE)."], "controle-de-acesso": ["HTTP Basic"]},
{"api_name": "Consulta Cadastro Integrado de Projetos de Investimentos – Obrasgov.br ", "uuid": "consulta-cadastro-integrado-de-projetos-de-investimentos-2013-obrasgov.br", "orgao": "Ministério da Gestão e da Inovação em Serviços Públicos - Secretaria de Gestão e Inovação (MGI/SEGES)", "versao": "Versão v.1.0  - 24/10/2023", "descricao": "O Cadastro Integrado de Projetos de Investimentos, o Obrasgov.br, foi instituído pelo Decreto nº 10.496, de 28 de setembro de 2020, que o institui para o registro centralizado de informações de projetos de investimento em infraestrutura, custeados com recursos dos Orçamentos Fiscal e da Seguridade Social, no âmbito dos órgãos e entidades do Poder Executivo federal integrantes dos Orçamentos Fiscal e da Seguridade Social.\nEsta API trata os seguintes dados:\nCom essa API, é possível identificar os quantitativos de obras que estão em execução, paralisadas ou concluídas nas regiões do Brasil.\nO Obrasgov.br foi instituído pelo Decreto nº 10.496, de 28 de setembro de 2020 e regulamentado pela PORTARIA SEGES/ME Nº 25.405, DE 23 DE DEZEMBRO DE 2020.\nGoverno Federal, Estados, Distrito Federal, Municípios, Órgãos de Controle e Organizações da Sociedade Civil.", "docs": null, "links": ["/obrasgov/api/api-obrasgov-docs", "https://api.obrasgov.gestao.gov.br/obrasgov/api/swagger-ui/index.html"], "tecnologias": ["JSON"], "tags": ["OBRAS", "MinistériodaGestão", "CIPI", "OBRASGOV"], "seguranca": ["SSL"], "hospedagem": ["Ministério da Gestão e da Inovação em Serviços Públicos (MGI)"], "controle-de-acesso": ["Livre"]},
{"api_name": "Fala.Br - Ouvidorias", "uuid": "fala-br", "orgao": "Controladoria Geral da União (CGU)", "versao": "Versão 1.13 - 01/07/2020", "descricao": "O Fala.Br é um canal integrado para encaminhamento de manifestações (denúncias, reclamações, solicitações, sugestões e elogios) a órgãos e entidades do Poder Executivo federal. \nA API disponibiliza serviços para que aplicações de terceiros possam cadastrar, consultar e tratar manifestações.", "docs": null, "links": ["https://falabr.cgu.gov.br/api/*", "https://falabr.cgu.gov.br/help"], "tecnologias": ["JSON"], "tags": ["CGU", "Fala.Br", "OGU"], "seguranca": ["SSL"], "hospedagem": ["CGU"], "controle-de-acesso": ["OAuth"]},
{"api_name": "COFIEX - Comissão de Financiamentos Externos", "uuid": "cofiex", "orgao": "Ministério da Economia (ME)", "versao": "Versão 1.0 - 29/10/2021", "descricao": "Disponibilização de dados sobre projetos e programas do setor público que contam com financiamento externo de organismos multilaterais e bilaterais, no âmbito das atribuições da Secretaria de Assuntos Econômicos Internacionais e da Comissão de Financiamentos Externos – COFIEX.\n ", "docs": null, "links": ["https://apicofiex.economia.gov.br/api-docs/", "https://apicofiex.economia.gov.br/api-docs/"], "tecnologias": ["JSON CSV"], "tags": ["SIGS", "COFIEX"], "seguranca": ["SSL"], "hospedagem": ["Infraestrutura do próprio órgão"], "controle-de-acesso": ["Livre"]},
{"api_name": "Autenticação SIGAC", "uuid": "autenticacao-sigac", "orgao": "Ministério da Economia (ME)", "versao": "Versão 1.0 - 18/09/2018", "descricao": "O SIGAC é responsável pela autenticação e autorização dos módulos do sistema SIGEPE e pela autenticação de demais aplicações parceiras que utilizam da base de dados do SIGAC para realizar suas operações de autenticação.", "docs": null, "links": ["https://servicos.gestaodeacesso.planejamento.gov.br/sigepe-gerid-webservices/ AutorizacaoMovelWsImplService"], "tecnologias": ["SOAP XML"], "tags": ["Ministério da Economia (ME)", "SERPRO", "SIGAC", "Autenticação"], "seguranca": ["SSL"], "hospedagem": ["SERPRO"], "controle-de-acesso": ["Certificado Digital"]},
{"api_name": "Assinatura Digital Avançada", "uuid": "assinatura-digital-avancada", "orgao": "Instituto Nacional de Tecnologia da Informação  (ITI)", "versao": "Versão 1.0 - 10/08/2020", "descricao": "A assinatura eletrônica destina-se a interações com o Poder Público e permite que você assine um documento em meio digital a partir da sua conta govbr. O documento com a assinatura digital avançada tem a mesma validade de um documento com assinatura física e é regulamentado pelo \n.\nPara a assinatura avançada é necessário que o cidadão possua uma conta govbr “\nou “\n(contas “\nnão podem utilizar o serviço).", "docs": null, "links": ["https://manual-integracao-assinatura-eletronica.servicos.gov.br/"], "tecnologias": ["REST / JSON"], "tags": ["Assinatura", "Assinaturaeletronica", "Acesso gov.br"], "seguranca": [], "hospedagem": ["Instituto de Tecnologia da Informação - ITI"], "controle-de-acesso": []},
{"api_name": "Acesso gov.br ", "uuid": "brasil-cidadao-login-unico", "orgao": "Ministério da Economia – Secretaria de Governo Digital (ME/SGD)", "versao": "Versão V2.10 - 01/09/2020", "descricao": "A conta gov.br é um meio de acesso digital do usuário aos serviços públicos digitais.   Esta Conta garante a identificação de cada cidadão que acessa os serviços digitais do governo.  Essa é a nova proposta do Governo federal, para facilitar a identificação e autenticação do cidadão, privilegiando a governança e a convergência autoritativa, e finalmente o controle de acesso unificado.\nO Acesso gov.br opera um conjunto de APIs interdependentes: \n ;  \n;  API Acesso gov.br - Categorias. \nEstas APIs possibilitam a integração ao Portal de login único do cidadão. ", "docs": null, "links": ["https://acesso.gov.br", "https://manual-roteiro-integracao-login-unico.servicos.gov.br/pt/stable/iniciarintegracao.html#metodos-e-interfaces-de-integracao-passo-a-passo-para-integrar"], "tecnologias": ["OPENID-CONNECT; SOAP"], "tags": ["Login Único", "Ministério da Economia"], "seguranca": ["SSL"], "hospedagem": ["SERPRO"], "controle-de-acesso": ["OAuth Outro"]},
{"api_name": "Registro de Ocupação Hospitalar COVID-19", "uuid": "registro-de-ocupacao-hospitalar-covid-19", "orgao": "Ministério da Saúde (MS)", "versao": "Versão 1.0 - 11/08/2020", "descricao": "O Ministério da Saúde, por meio da Secretaria de Atenção Especializada em Saúde (SAES), implementou, devido à pandemia, o registro da ocupação hospitalar em leitos COVID e demais leitos, ou seja, o censo hospitalar diário.\nEsta API  tem como finalidade disponibilizar o banco de dados da ocupação dos leitos, a partir da incorporação do sistema e-SUS Notifica, em vigor a partir de abril de 2020.", "docs": null, "links": ["https://opendatasus.saude.gov.br/dataset/registro-de-ocupacao-hospitalar", "https://opendatasus.saude.gov.br/dataset/registro-de-ocupacao-hospitalar"], "tecnologias": ["CSV"], "tags": ["SVS", "Ministério da Saúde"], "seguranca": ["Nenhum"], "hospedagem": ["DataSUS"], "controle-de-acesso": ["Livre"]},
{"api_name": "Notificações de Síndrome Gripal", "uuid": "notificacoes-de-sindrome-gripal", "orgao": "Ministério da Saúde (MS)", "versao": "Versão 1.0 - 14/10/2020", "descricao": "O Ministério da Saúde, por meio da Secretaria de Vigilância em Saúde (SVS), implementou, devido à pandemia, a vigilância da Síndrome Gripal (SG) de casos leves a moderados suspeitos de COVID-19.\n Esta API tem como finalidade disponibilizar o banco de dados epidemiológicos de SG, a partir da incorporação do sistema e-SUS VE Notifica, em vigor a partir de março de 2020.", "docs": null, "links": ["https://opendatasus.saude.gov.br/dataset/casos-nacionais", "https://opendatasus.saude.gov.br/dataset/casos-nacionais"], "tecnologias": ["CSV"], "tags": ["SVS", "Ministério da Saúde", "Notificações de Síndrome Gripal"], "seguranca": [], "hospedagem": ["DataSUS"], "controle-de-acesso": []},
{"api_name": "SNCR - Sistema Nacional de Cadastro Rural", "uuid": "sncr-sistema-nacional-de-cadastro-rural", "orgao": "Instituto Nacional de Colonização e Reforma Agrária (INCRA)", "versao": "Versão 2.1 - 06/10/2021", "descricao": "", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/api-sncr/v1/verificarSituacaoImovel/", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-sncr/v1/consultarImovelPorCodigo/", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-sncr/v1/consultarImovelPorCpfCnpj/", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/api-sncr/v1/verificarSituacaoImovel/", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/api-sncr/v1/consultarImovelPorCodigo/", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/api-sncr/v1/consultarImovelPorCpfCnpj/", "https://www.gov.br/conecta/catalogo/apis/sncr-sistema-nacional-de-cadastro-rural/Manual%20de%20Integracao%20-%20SNCR%20API%20-%20V2.pdf/at_download/file", "https://gerenciador-conecta.readthedocs.io/manual_recebedor_dados.html#roteiro-geracao-chaves-acesso"], "tecnologias": ["JSON"], "tags": ["sncr", "incra", "imóvelrural"], "seguranca": ["SSL"], "hospedagem": ["SERPRO"], "controle-de-acesso": ["OAuth"]},
{"api_name": "SNCCI - Sistema Nacional de Concessão de Créditos de Instalação", "uuid": "sncci", "orgao": "Instituto Nacional de Colonização e Reforma Agrária (INCRA)", "versao": "Versão 1.0 - 06/10/2021", "descricao": "", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/sncci/v1/parcelas", "https://apigateway.conectagov.estaleiro.serpro.gov.br/sncci/v1/creditos/", "https://apigateway.conectagov.estaleiro.serpro.gov.br/sncci/v1/creditos-ativos", "https://apigateway.conectagov.estaleiro.serpro.gov.br/sncci/v1/boletos", "https://www.gov.br/conecta/catalogo/apis/sncci/swagger_sncci.json/swagger_view", "https://gerenciador-conecta.readthedocs.io/manual_recebedor_dados.html#roteiro-geracao-chaves-acesso"], "tecnologias": ["REST JSON"], "tags": ["créditoinstalação", "reformaagrária", "incra"], "seguranca": ["SSL"], "hospedagem": ["INCRA"], "controle-de-acesso": ["OAuth"]},
{"api_name": "SIGEF GEO", "uuid": "sigef-geo", "orgao": "Instituto Nacional de Colonização e Reforma Agrária (INCRA)", "versao": "Versão V1.1 - 04/08/2021", "descricao": "", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/api-sigef-geo/v1/parcelas", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/oauth2/token", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/api-sigef-geo/v1/parcelas", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/oauth2/token", "https://www.gov.br/conecta/catalogo/apis/sigef-geo/sigef-geo-01-json/swagger_view", "https://gerenciador-conecta.readthedocs.io/manual_recebedor_dados.html#roteiro-geracao-chaves-acesso"], "tecnologias": [], "tags": [], "seguranca": [], "hospedagem": [], "controle-de-acesso": []},
{"api_name": "SIPRA - Beneficiários da Reforma Agrária", "uuid": "sipra-reforma-agraria", "orgao": "Instituto Nacional de Colonização e Reforma Agrária (INCRA)", "versao": "Versão V1.0", "descricao": "", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/api-sipra/v1/beneficiarios/", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-sipra/v1/beneficiarios/espelho/", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-sipra/v1/certidao/", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-sipra/v1/beneficiarios/ACNNNNNNNNNNNN​/divergencias-receita", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/api-sipra/v1/beneficiarios", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/api-sipra/v1/beneficiarios/espelho/", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/api-sipra/v1/certidao/", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/api-sipra/v1/beneficiarios/ACNNNNNNNNNNNN​/divergencias-receita", "http://api.incra.gov.br/sipra/swagger-ui/index.html?configUrl=/sipra/v3/api-docs/swagger-config", "https://api.incra.gov.br/sipra/swagger-ui/index.html?configUrl=/sipra/v3/api-docs/swagger-config", "https://gerenciador-conecta.readthedocs.io/manual_recebedor_dados.html#roteiro-geracao-chaves-acesso"], "tecnologias": ["JSON"], "tags": ["INCRA", "SIPRA", "BENEFICIARIO"], "seguranca": ["SSL"], "hospedagem": ["INCRA"], "controle-de-acesso": ["OAuth"]},
{"api_name": "Declaração de Aptidão ao Pronaf (DAP)", "uuid": "infodap", "orgao": "Ministério da Agricultura, Pecuária e Abastecimento (MAPA)", "versao": "Versão 1.0", "descricao": "A API InfoDAP tem a finalidade de disponibilizar informações da Declaração de Aptidão ao Pronaf (DAP), documento que identifica e qualifica o público definido da Lei 11.326/2006 para acesso diferenciado a políticas públicas destinadas ao fortalecimento da agricultura familiar.\n Esta API trata dos seguintes dados:\nA Declaração de Aptidão ao Programa Nacional de Fortalecimento da Agricultura Familiar (DAP) é o instrumento utilizado para identificar e qualificar as Unidades Familiares de Produção Agrária (UFPA) da Agricultura Familiar e suas formas associativas organizadas em pessoas jurídicas. Consideram-se beneficiários de DAP a UFPA composta por: agricultores/as familiares, pescadores artesanais, aquicultores, maricultores, silvicultores, extrativistas, quilombolas, indígenas, assentados da reforma agrária e beneficiários do Programa Nacional de Crédito Fundiário.\n ", "docs": null, "links": ["http://infodap.mda.gov.br/ws_infodap/WCF_infoDap.svc"], "tecnologias": ["SOAP XML"], "tags": ["MAPA", "InfoDAP", "DAP"], "seguranca": ["SSL"], "hospedagem": ["MAPA"], "controle-de-acesso": ["Outro"]},
{"api_name": "CTCA - Controle de Tensões e Conflitos Agrários", "uuid": "ctca", "orgao": "Instituto Nacional de Colonização e Reforma Agrária (INCRA)", "versao": "Versão 1.1 - 23/06/2021", "descricao": "", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/api-ctca/v1/", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/oauth2/token", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/api-ctca/v1/", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/oauth2/token", "https://www.gov.br/conecta/catalogo/apis/ctca/ctca/swagger_view", "https://gerenciador-conecta.readthedocs.io/manual_recebedor_dados.html#roteiro-geracao-chaves-acesso"], "tecnologias": ["REST/JSON"], "tags": ["conflitoagrario", "tca", "ctca", "cca", "incra"], "seguranca": ["SSL"], "hospedagem": [], "controle-de-acesso": ["HTTP Basic OAuth"]},
{"api_name": "CADASTUR - Cadastro de Prestadores de Serviços Turísticos", "uuid": "cadastur-cadastro-de-prestadores-de-servicos-turisticos", "orgao": "Subsecretaria de Tecnologia da Informação e Inovação (STII)", "versao": "Versão 1.0.0 - 01/07/2021", "descricao": "O Cadastur é o sistema de cadastro de pessoas físicas e jurídicas que atuam no setor de turismo e garante diversas vantagens e oportunidades aos seus cadastrados e é também uma importante fonte de consulta para o turista. Também visa promover o ordenamento, a formalização e a legalização dos prestadores de serviços turísticos no Brasil, por meio do cadastro de empresas e profissionais do setor.\nO programa é executado pelo Ministério do Turismo, em parceria com os órgãos oficiais de turismo, nos 26 estados e no Distrito Federal.\nConforme a Lei nº 11.771, de 17 de setembro de 2008 entende-se como prestadores de serviços turísticos as sociedades empresárias, sociedades simples, os empresários individuais e os serviços sociais autônomos que prestem serviços turísticos remunerados e que exerçam atividades econômicas relacionadas à cadeia produtiva do turismo.\nAinda conforme a Lei nº 11.771 o cadastro é gratuito, sendo obrigatório para:\n● Acampamentos Turísticos;\n● Agências de Turismo;\n● Meios de Hospedagem;\n● Organizadoras de Evento;\n● Parques Temáticos;\n● Transportadoras Turísticas;\nE opcional para as seguintes atividades:\n● Casas de Espetáculo\n● Centros de Convenções\n● Empreendimentos de Entretenimento e Lazer e Parques Aquáticos\n● Empreendimentos de Apoio ao Turismo Náutico ou à Pesca Desportiva\n● Locadoras de Veículos para Turistas\n● Prestadoras de Serviços de Infraestrutura para Eventos\n● Prestadoras Especializadas em Segmentos Turísticos\n● Restaurantes, Cafeterias, Bares e similares\nO cadastro também é obrigatório para exercer a profissão de Guia de Turismo, conforme Lei nº 8.623, de 28 de janeiro de 1993. O Cadastro neste sistema oferece:\n● Acesso a financiamento por meio de bancos oficiais;\n● Apoio em eventos, feiras e ações do Ministério do Turismo;\n● Incentivo à participação em programas e projetos do governo federal;\n● Participação em programas de qualificação promovidos e apoiados pelo Ministério do Turismo;\n● Viabilidade de Participação em Licitações para os certames que exigem o Certificado CADASTUR;\n● Acesso a Auxílios Emergenciais que podem vir exigir a regularidade do cadastro para sua concessão;\n● Visibilidade nos sites do Cadastur e do Programa Viaje Legal. Mais informações sobre o sistema CADASTUR podem ser encontradas no site ", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cadastur/v1/pessoa-juridica/obter-dados-atividade-pj", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cadastur/v1/guia-pessoa/obter-pessoa", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/api-cadastur/v1/pessoa-juridica/obter-dados-atividade-pj", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/api-cadastur/v1/guia-pessoa/obter-pessoa", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/oauth2/token", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/oauth2/token", "https://www.gov.br/conecta/catalogo/apis/cadastur-cadastro-de-prestadores-de-servicos-turisticos/cadastur-cadastro-de-prestadores-de-servicos-turisticos/swagger_view", "https://gerenciador-conecta.readthedocs.io/manual_recebedor_dados.html#roteiro-geracao-chaves-acesso"], "tecnologias": ["application / JSON"], "tags": ["Turismo", "CertificadoCadastur", "MinistériodoTurismo", "Cadastur", "PrestadorServiçoTuristico", "MTur"], "seguranca": ["SSL"], "hospedagem": ["Infraestrutura do próprio órgão."], "controle-de-acesso": ["OAuth"]},
{"api_name": "Informações dos Regimes Públicos de Previdência Social - CADPREV", "uuid": "cadprev", "orgao": "Subsecretaria dos Regimes Próprios de Previdência Social  (ME)", "versao": "Versão 1.0 - 16/07/2021", "descricao": "São disponibilizadas informações previdenciárias, atuariais, repasses, aplicações e investimentos dos recursos, referentes aos Regimes Próprios de Previdência Social dos Estados, Distrito Federal e dos Municípios.", "docs": null, "links": ["https://apicadprev.economia.gov.br/api-docs/"], "tecnologias": ["JSON e CSV"], "tags": ["RPPS", "CADPREV", "DADOSABERTOS", "ENTESFEDERATIVOS"], "seguranca": ["Nenhum"], "hospedagem": ["Infraestrutura do próprio órgão"], "controle-de-acesso": ["Livre"]},
{"api_name": "ID Jovem", "uuid": "id-jovem", "orgao": "SNJ - Secretaria Nacional da Juventude da Secretaria-Geral da Presidência da República.", "versao": "Versão v1 - 10/07/2022", "descricao": "A API ID Jovem realiza uma consulta para validação por instituições públicas e privadas do documento gratuito virtual ID Jovem, que comprova a condição de baixa renda de jovens de 15 a 29 anos inscritos no Cadastro Único para Programas Sociais do Governo Federal (CadÚnico).", "docs": null, "links": ["https://idjovem.juventude.gov.br/apiv1consultaid", "https://app.swaggerhub.com/apis/join_tecnologia/idjovem/1.0.0"], "tecnologias": ["REST / JSON"], "tags": ["MinistérioMulherFamíliaDireitosHumanos", "MDH", "MMFDH", "SNJ"], "seguranca": ["SSL"], "hospedagem": ["Infraestrutura do MMFDH"], "controle-de-acesso": ["HTTP Basic"]},
{"api_name": "Relação Trabalhista ", "uuid": "relacao-trabalhista", "orgao": "Instituto Nacional do Seguro Social (INSS)", "versao": "Versão 1.0.1 - 30/06/2021", "descricao": "O Cadastro Nacional de Informações Sociais - CNIS, é um banco de dados do Governo Federal que armazena informações trabalhistas e previdenciárias dos trabalhadores brasileiros.\nAdministrado pela Instituto Nacional do Seguro Social - INSS, pela Receita Federal - RFB e pela Secretaria de Previdência Ministério do Trabalho e Previdência, e operacionalizado pela Empresa de Tecnologia e Informações da Previdência - Dataprev, ele tem como principal função servir como prova perante a Previdência Social sobre os vínculos anotados, a remuneração indicada e as contribuições feitas ao INSS.\nUtilizando como base as informações contidas no CNIS, a API Relação Trabalhista tem como finalidade retornar uma lista relações trabalhistas, conforme Tabela Oficial da Classificação Brasileira de Ocupações (CBO), de um determinado CPF pesquisado.\nA API otimiza o tempo que o cidadão levaria para informar os vínculos empregatícios dele, bem como o tempo que o órgão levaria para validar as informações coletadas.\nO impacto estimado da interoperabilidade deste serviço público é de \n. \nPara maiores informações sobre a metodologia de Cálculo de Impacto da Interoperabilidade, acesse: https://www.gov.br/governodigital/pt-br/governanca-de-dados/calculadora-de-impacto \n ", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/api-relacao-trabalhista/v1/relacoes-trabalhistas?cpf=", "https://www.gov.br/conecta/catalogo/apis/relacao-trabalhista/relacao_trabalhista_final.json/swagger_view", "https://gerenciador-conecta.readthedocs.io/manual_recebedor_dados.html#roteiro-geracao-chaves-acesso"], "tecnologias": ["REST/JSON"], "tags": ["DATAPREV", "RELACAOTRABALHISTA", "INSS", "CLT"], "seguranca": ["SSL"], "hospedagem": ["DATAPREV"], "controle-de-acesso": ["OAuth"]},
{"api_name": "CNS - Cartão Nacional de Saúde", "uuid": "cadsus-cadastro-de-usuarios-do-sus", "orgao": "Ministério da Saúde (MS)", "versao": "Versão 1.2 - 10/04/2018", "descricao": "O Web Service do Cartão Nacional de Saúde foi desenvolvido para operacionalizar a troca de informações cadastrais dos Usuários do SUS, permitindo a integração entre Sistemas de Informação em Saúde Estaduais, Municipais, Agência Nacional de Saúde – ANS e Operadoras de Plano de Saúde.\nUtiliza a base de dados do Cadastro Nacional de Usuários do SUS - CadSUS. ", "docs": null, "links": ["https://servicos-datasus.saude.gov.br/detalhe/tgKoKpju8s", "https://servicos-datasus.saude.gov.br/detalhe/tgKoKpju8s", "https://servicos-datasus.saude.gov.br/detalhe/tgKoKpju8s"], "tecnologias": ["SOAP PIX-PDQ V3/XML"], "tags": ["CNS", "Ministério da Saúde"], "seguranca": ["WS-Security"], "hospedagem": ["DataSUS"], "controle-de-acesso": ["Outro"]},
{"api_name": "Consulta de Condutas Anticompetitivas", "uuid": "consulta-de-condutas-anticompetitivas", "orgao": "Conselho Administrativo de Defesa Econômica (CADE)", "versao": "Versão 1.0 - 25/06/2021", "descricao": "A API realiza a consulta de Condutas Anticompetitivas no âmbito do CADE.\nUma conduta anticompetitiva é qualquer prática adotada por um agente econômico que possa, ainda que potencialmente, causar danos à livre concorrência, mesmo que o infrator não tenha tido intenção de prejudicar o mercado.\nO poder de mercado por si só não é considerado ilegal, mas quando uma empresa ou grupo de empresas abusa desse poder adotando uma conduta que fere a livre concorrência, a prática configura-se em abuso de poder econômico. Esse abuso não está limitado a um conjunto restrito de práticas específicas, uma vez que a análise sobre a possibilidade de uma conduta causar dano à concorrência é complexa e são muitos os fatores analisados para que se possa caracterizar determinada prática como abuso.\nPor isso, a legislação é ampla, permitindo a atuação do Cade para reprimir as condutas que, após investigação, possam ser caracterizadas como danosas à concorrência.", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/oauth2/jwt-token", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-conduta-anticompetitiva/v1/conduta-anticompetitiva/findByDocumento/:cpfOuCpnjSomenteNumeros", "https://apis.cade.gov.br/", "https://gerenciador-conecta.readthedocs.io/manual_recebedor_dados.html#roteiro-geracao-chaves-acesso"], "tecnologias": ["JSON"], "tags": ["CONDUTA ANTICOMPETITIVA", "CADE"], "seguranca": ["SSL"], "hospedagem": ["CADE"], "controle-de-acesso": ["HTTP Basic OAuth"]},
{"api_name": "Benefício de Prestação Continuada - BPC", "uuid": "beneficio-de-prestacao-continuada-bpc", "orgao": "Instituto Nacional do Seguro Social (INSS)", "versao": "Versão 2.1 - 05/05/2020", "descricao": "Consultar se a Pessoa Física possui Benefício ATIVO (código 00) do tipo LOAS 87 (AMPARO SOCIAL À PESSOA PORTADORA DE NECESSIDADES ESPECIAIS), a partir de um CPF passado como parâmetro.\n \nO Impacto estimado da Interoperabilidade deste serviço público é de \n.\nPara maiores informações sobre a metodologia de Cálculo de Impacto da Interoperabilidade, acesse:  \n ", "docs": null, "links": [], "tecnologias": ["REST JSON"], "tags": ["BPC", "INSS"], "seguranca": ["SSL"], "hospedagem": ["Dataprev"], "controle-de-acesso": ["OAuth"]},
{"api_name": "CadÚnico Serviços", "uuid": "cadunico-servicos", "orgao": "Ministério do Desenvolvimento e Assistência Social, Família e Combate à Fome", "versao": "Versão 1.0.0 - 12/12/2022", "descricao": "O Cadastro Único para Programas Sociais do Governo Federal (Cadastro Único) é um instrumento que identifica e caracteriza as famílias de baixa renda, permitindo que o governo conheça melhor a realidade socioeconômica dessa população. Nele são registradas informações como: características do domicílio, identificação de cada pessoa, escolaridade, situação de trabalho e renda, entre outras.\nEssas informações são utilizadas pelo Governo Federal, pelos Estados e pelos municípios para implementação de políticas públicas capazes de promover a melhoria da vida dessas famílias.\nUtilizando como base as informações contidas no Cadastro Único, a API CadÚnico Serviços tem como finalidade retornar para uma determinada pessoa:\n A API otimiza o tempo que o cidadão levaria para comprovar os dados, bem como o tempo que o órgão levaria para validar as informações coletadas.", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cadunico-servicos/v1/situacaoCadastral/", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cadunico-servicos/v1/situacaoCadastral/nis", "https://www.gov.br/conecta/catalogo/apis/cadunico-servicos/cadunico_servicos.json/swagger_view", "https://gerenciador-conecta.readthedocs.io/manual_recebedor_dados.html#roteiro-geracao-chaves-acesso"], "tecnologias": ["REST/JSON"], "tags": ["MinisteriodaCidadaniaMC", "CadUnico"], "seguranca": ["SSL"], "hospedagem": ["Dataprev"], "controle-de-acesso": ["API Keys"]},
{"api_name": "Cadastro Base do Cidadão (CPF)", "uuid": "cadastro-base-do-cidadao-cbc-cpf", "orgao": "Receita Federal do Brasil (RFB)", "versao": "Versão 2.5.0 - 28/04/2022", "descricao": "O Cadastro Base do Cidadão - CBC foi instituído pelo \n e é a base de referência de cadastros de pessoas físicas para todos os órgãos e entidades da administração pública federal direta, autárquica e fundacional. Em sua primeira versão, o CBC utiliza a base cadastral de pessoas físicas - CPF da Receita Federal (RFB).\nEssa base conta hoje com cerca de 250 milhões de registros (considerando brasileiros, estrangeiros e falecidos).\nA versão atualizada da \n contempla novos métodos que retornam conjuntos específicos de dados de acordo com o tema.  O objetivo é retornar apenas o conjunto de dados necessário para obter informações de acordo com o tema abordado. Por exemplo, o método \n retorna apenas dados de nacionalidade e naturalidade.\nContudo, a nova versão da API ainda contempla o método \n, que retorna os dados completos de uma lista de cidadãos.\nO impacto estimado da interoperabilidade deste serviço público por transação é de \n.\nPara maiores informações sobre a metodologia de Cálculo de Impacto da Interoperabilidade, acesse:  ", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cpf-light/v2/consulta/cpf", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cpf-light/v2/consulta/dados-cadastrais", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cpf-light/v2/consulta/dados-sensiveis", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cpf-light/v2/consulta/identificao", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cpf-light/v2/consulta/nacionalidade-naturalidade", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cpf-light/v2/consulta/ocupacao", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cpf-light/v2/consulta/localizacao", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cpf-light/v2/consulta/telemovel", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cpf-light/v2/consulta/domicilio-fiscal", "https://gerenciador-conecta.readthedocs.io/outras_informacoes_tecnicas.html"], "tecnologias": ["REST / JSON"], "tags": ["CBC", "CPF"], "seguranca": ["SSL"], "hospedagem": ["Serpro"], "controle-de-acesso": ["OAuth"]},
{"api_name": "Cadastro Base de Endereço  (CEP)", "uuid": "cep-codigo-de-enderecamento-postal", "orgao": "Ministério da Gestão e da Inovação em Serviços Públicos - Secretaria de Governo Digital (MGI/SGD)", "versao": "Versão 1.0 - 01/10/2020", "descricao": "A API do Cadastro Base de Endereço proporciona a interoperabilidade e a integração no uso do conjunto mínimo de dados de endereço, que atualmente conta com dados vinculados ao CEP, visando facilitar o acesso ao conjunto de dados necessário pelos Órgãos e Entidades da Administração Pública Federal Direta, Autárquica e Fundacional e demais Poderes da União, bem como integrantes da Rede Gov.br e demais interessados em suas iniciativas para um Governo 100% integrado, sendo mais um instrumento para impulsionar a transformação digital no Estado brasileiro.\n \nO Impacto estimado da Interoperabilidade deste serviço público é de \n.\nPara maiores informações sobre a metodologia de Cálculo de Impacto da Interoperabilidade, acesse:  \n \nAPI é a sigla em inglês para Application Programming Interface, ou interface de programação de aplicações. As interfaces de programação de aplicativos (APIs) são conjuntos de ferramentas, definições e protocolos para a criação de aplicações de software. APIs conectam soluções e serviços, sem a necessidade de saber como esses elementos foram implementados.", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/api-cep/v1/consulta/cep/", "https://h-apigateway.conectagov.estaleiro.serpro.gov.br/api-cep/v1/consulta/cep/", "https://www.gov.br/conecta/catalogo/apis/cep-codigo-de-enderecamento-postal/swagger-json/swagger_view"], "tecnologias": ["application/json"], "tags": ["CEP", "CadastroReferência", "CREndereço"], "seguranca": [], "hospedagem": ["Serpro"], "controle-de-acesso": ["OAuth"]},
{"api_name": "API Benefícios Previdenciários", "uuid": "api-beneficios-previdenciarios", "orgao": "Instituto Nacional do Seguro Social (INSS)", "versao": "Versão 2.3.2 - 25/10/2022", "descricao": "O cadastro de Benefícios do Regime Geral de Previdência Social é gerido pelo INSS e operacionalizado pela Empresa de Tecnologia e Informações da Previdência – Dataprev.\nUtilizando como base as informações contidas no cadastro de benefícios do INSS, a API Benefícios tem como finalidade retornar uma lista de benefícios com principais atributos para a pessoa pesquisada. Os benefícios podem ser de diversas espécies, em que cada uma representa a classificação do tipo do benefício com suas regras e peculiaridades e é representada por um código numérico de 2 posições.\nA API otimiza o tempo que o cidadão levaria para informar os benefícios percebidos por ele, bem como o tempo que o órgão levaria para validar as informações coletadas.", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/api-beneficios-previdenciarios/v3/beneficios?cpf=", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-beneficios-previdenciarios/v3/beneficios/pertence-especie?cpf=", "https://apigateway.conectagov.estaleiro.serpro.gov.br/api-beneficios-previdenciarios/v3/beneficios/pertence-especie-87?cpf=", "https://www.gov.br/conecta/catalogo/apis/api-beneficios-previdenciarios/Beneficios_previdenciarios.json/swagger_view", "https://gerenciador-conecta.readthedocs.io/manual_recebedor_dados.html#roteiro-geracao-chaves-acesso"], "tecnologias": ["JSON"], "tags": ["Benefícios", "INSS"], "seguranca": ["SSL"], "hospedagem": ["Dataprev"], "controle-de-acesso": ["OAuth"]},
{"api_name": "RNDS - Rede Nacional de Dados em Saúde", "uuid": "rnds-rede-nacional-de-dados-em-saude", "orgao": "Ministério da Saúde (MS)", "versao": "Versão 1.0 - 05/04/2020", "descricao": "A Rede Nacional de Dados em Saúde (RNDS) é uma plataforma nacional de integração de dados em saúde e é um projeto estruturante do Conecte SUS, programa do Governo Federal para a transformação digital da saúde no Brasil.\n O Web Service da RNDS foi desenvolvido para permitir que os Laboratórios de Análises Clínicas compartilhem os resultados de exames de detecção do COVID-19 para a RNDS disponibilizando resultados confiáveis para quem precisa no momento que precisa.  A API tem como principais usuários os Laboratórios de Análises Clínicas públicos e privados.\n ", "docs": null, "links": ["https://servicos-datasus.saude.gov.br/detalhe/UZQjoYDDFN", "https://servicos-datasus.saude.gov.br/detalhe/UZQjoYDDFN"], "tecnologias": ["RESTFULL FHIR v4 / JSON"], "tags": ["RNDS", "Ministério da Saúde"], "seguranca": ["Outro"], "hospedagem": ["DataSUS"], "controle-de-acesso": ["Certificado Digital"]},
{"api_name": "Registro de Referência - Estruturas Organizacionais do Poder Executivo Federal (SIORG)", "uuid": "estrutura-organizacional", "orgao": "Ministério da Gestão e da Inovação em Serviços Públicos - Secretaria de Gestão e Inovação (MGI/SEGES)", "versao": "Versão 3.3", "descricao": "Esta API trata dos seguintes dados:\nEstes serviços estão disponíveis apenas para consulta.", "docs": null, "links": ["https://estruturaorganizacional.dados.gov.br", "https://api.siorg.economia.gov.br/"], "tecnologias": ["SOAP JSON REST XML"], "tags": ["Ministério da Economia (ME)", "SIORG", "Estrutura Organizacional"], "seguranca": ["SSL"], "hospedagem": ["Ministério da Economia (ME)"], "controle-de-acesso": ["Livre"]},
{"api_name": "Registro de Referência - Servidores Públicos Federais (SIAPE Consultas)", "uuid": "consulta-siape", "orgao": "Ministério da Gestão e da Inovação em Serviços Públicos - Secretaria de Gestão de Pessoas e Relações de Trabalho (MGI/SGPRT)", "versao": "Versão 1.0 - 27/10/2020", "descricao": "O objetivo da API SIAPE Consultas é possibilitar o acesso, em tempo real, por parte dos Sistemas Autorizados, aos dados dos servidores ativos, aposentados e pensionistas, que recebem seus pagamentos pelo SIAPE.", "docs": null, "links": ["https://apigateway.conectagov.estaleiro.serpro.gov.br/api-consulta-siape/v1/consulta-siape", "https://www.gov.br/conecta/catalogo/apis/consulta-siape/ws_siape_consultas-pdf/at_download/file"], "tecnologias": ["SOAP / XML"], "tags": ["Ministério da Gestão e da Inovação em Serviços Públicos", "SIAPE", "Servidor Público"], "seguranca": ["SSL"], "hospedagem": ["SERPRO"], "controle-de-acesso": ["OAuth"]}
]